from typing import Optional

BACK_TO_RUSMAN = [{"text": "Понятно, ещё вопрос", "next": "rusman_talk"}]
EXIT_SHOP = [{"text": "Выйти из магазина", "next": "exit_shop_moon"}]
NICK_CHOICES = [
    {"text": "{player_name}", "next": "nick_player_name",
     "condition": {"flag_absent": "tried_player_name"},
     "gives": {"flags": {"tried_player_name": True}, "trust": {"Kacap": +5}}},
    {"text": "Лохнесс", "next": "nick_lohness",
     "condition": {"flag_absent": "tried_lohness"},
     "gives": {"flags": {"tried_lohness": True}, "trust": {"Kacap": -5}}},
    {"text": "Косяк", "next": "nick_kosyak",
     "condition": {"flag_absent": "tried_kosyak"},
     "gives": {"flags": {"tried_kosyak": True}, "trust": {"Kacap": -2}}},
    {"text": "Паранойис", "next": "nick_paranoic",
     "condition": {"flag_absent": "tried_paranoic"},
     "gives": {"flags": {"tried_paranoic": True}, "trust": {"Kacap": +3}}},
    {"text": "Громила Дуб", "next": "nick_dub",
     "condition": {"flag_absent": "tried_dub"},
     "gives": {"flags": {"tried_dub": True}, "trust": {"Kacap": -3}}},
    {"text": "Дрын Бывалый", "next": "nick_dryn",
     "condition": {"flag_absent": "tried_dryn"},
     "gives": {"flags": {"tried_dryn": True}, "trust": {"Kacap": +2}}},
    {"text": "Придумай сам", "next": "nick_self",
     "condition": {"flag_absent": "tried_self"},
     "gives": {"flags": {"tried_self": True}}},
]

CAR_CHOICES = [
    {"text": "Задать вопросы", "next": "more_question", "gives": {"trust": {"Kacap": -3}}},
    {"text": "Сидеть спокойно", "next": "no_action",  "gives": {"trust": {"Kacap": +5}}},
    {"text": "Спросить про аэрокар", "next": "asc_about_car",  "gives": {"trust": {"Kacap": +10}}},
]
DRINK_CHOICES = [
    {"text": "Выпить бутылку до дна", "next": "drink_hard", "gives": {"trust": {"Kacap": -5}}},  
    {"text": "Сделать 5 глотков и смачно крякнуть", "next": "drink_middle", "gives": {"trust": {"Kacap": +5}}},    
    {"text": "Сделать 1 глоток", "next": "drink_low", "gives": {"trust": {"Kacap": +3}}},   
    {"text": "Отказаться", "next": "no_drink", "gives": {"trust": {"Kacap": -4}}},        
]

KATSAP_QUESTION_CHOICES = [
    {"text": "Расскажи о корабле", "next": "asc_about_ship_fatal", "condition": {"flag_absent": "asc_about_ship_fatal"}, "gives": {"flags": {"asc_about_ship_fatal": True}}},
    {"text": "На кого ты работаешь?","next": "asc_about_work","condition": {"flag_absent": "asc_about_work"},"gives": {
        "flags": {"asc_about_work": True},
        "trust": {"Kacap": -7},
    },},
    {"text": "Расскажи мне о доме", "next": "asc_about_dom", "condition": {"flag_absent": "asc_about_dom"}, "gives": {"flags": {"asc_about_dom": True}}},  
    {"text": "Повтори еще раз про работу", "next": "asc_about_work_more", "condition": {"flag_absent": "asc_about_work_more"}, "gives": {"flags": {"asc_about_work_more": True}}},
    {"text": "Вопросов нет. Я пошел", "next": "corridor"},
]

SCENES = {
    "start": {
        "title": "Гнездо пиратов",
        "text": (
          "Вы, {player_name}, безжалостный космический пират, и наверняка знаете о пеленгской "
          "диверсионно-разведывательной организации Дзухаллаг, верно? Но, бьюсь об заклад, " 
          "вы даже не догадываетесь, что на одном из спутников планеты Полуось системы Бетельгейзе "
          "эти пираты строят новый военный крейсер, который будет совмещать в себе военный завод "
          "и боевую машину. Если запуск корабля будет успешным, пеленги начнут его массовое производство, "
          "что поставит под угрозу мир во всей Галактике. Ну, вы понимаете: внезапные нападения "
          "неидентифицированных кораблей, взаимные подозрения друг друга в Галактическом Совете, "
          "возможно, даже гражданская война между расами! А этого, думаю, никому не нужно! "
          "Особенно во времена войны с доминаторами. Теперь к делу. "
 
           "Вам, {player_name}, как пирату, ведь ничего не стоит сорвать строительство звездолета. "
           "Правда, есть маленький минус - чиновники планеты Полуось уже давно куплены пиратами, "
           "поэтому делают вид, что на спутниках ничего не происходит. "
           "Уничтожение корабля может сильно снизить их отношение к вам. "
           "Но ведь для пирата это не преграда, верно? Думаю, что да. "
           "Нам на планете Окошки Виста, кстати, ничего не стоит заплатить вам, скажем, 10000 кредитов, "
           "за такую приятную мелочь, даже за две: не люблю я Джоша Бдуша... "
           "Летите на планету Полуось, там найдите Русмана, он отсиживается изо дня в день "
           "в ресторане \"Жирная вилка\". Как прибудете, Русман все вам объяснит. "
           "Итак, корсар, договорились? "
        ),
        "choices": [
            {"text": "Я берусь за это задание", "next": "landing"},
            {"text": "Я отказываюсь от этого задания", "next": "rejected"},
        ],
    },
    "landing": {
        "title": "Гнездо пиратов",
        "text": (
            "Планета Полуось была заселена людьми и полностью индустриализирована многие столетия назад. "
            "Из-за выгодного транспортно-туристического расположения звездной системы поверхность планеты "
            "была покрыта сетью гостиниц, казино и ресторанов, переливающейся миллионами неоновых огней. "
            "Побродив немного по местным магазинам и поглядев на настоящие цены в шесть и более нулей, "
            "вы добрались до ресторана \"Жирная Вилка\", где и должен ждать вас Русман. "
            "Открывшиеся сами собой позолоченные двери гостеприимно приглашали расстаться со своими "
            "кровными кредитами. Вы вошли внутрь.» "
        ),
        "choices": [
            {"text": "Искать Русмана", "next": "rusman_talk"},
        ],
    },

    "rejected": {
        "title": "Гнездо пиратов",
        "text": (
            "— Ну и дурак, — раздался в трубке голос заказчика. — Такие деньги "
            "за простое дело, а он нос воротит. Пират, а туда же — совесть, "
            "видите ли, у него проснулась.\n\n"
            "В трубке щёлкнуло, и стало тихо. Вы отключили терминал, "
            "звёздная карта на мониторе погасла, оставив после себя только "
            "мягкое мерцание свободных секторов. Галактика большая — желающих "
            "заработать на чужих проблемах всегда хватает. Но и вам скучать "
            "не придётся: будет ещё заказ. Поинтереснее этого."
        ),
        "choices": [
           {"text": "Вернуться к брифингу и перечитать условия", "next": "start"},
        ],
    },

    "rusman_talk": {
        "title": "Гнездо пиратов",
        "text": (
            "Походив среди столиков, оглядывая посетителей ресторана, вы наконец нашли Русмана. "
            "Это был молодой человек лет двадцати шести с темными длинными волосами с татуировкой на плече "
            "в виде розы. Вы обменялись приветствиями, и Русман начал разговор: "
            "- {player_name}, скажи честно, зачем ты взял задание? "
            "- Из-за денег, конечно. Хочу, видишь ли, построить небольшой заводик по производству игрушек. "
            "- А ты с юмором, - хмыкнул он. - Но вернемся к делу. Пока ты где-то летал, "
            "пеленги полностью достроили крейсер, и задание немного усложнилось. "
            "Теперь нужно сорвать запуск корабля на второй луне планеты. "
            "Ты должен вести себя как настоящий пират и расположить к себе Кацапа, "
            "потому что только он знает точное местонахождение секретного космодрома. "
            "Когда узнаешь, где космодром, срочно сообщай мне об этом! "
            "Если Кацап будет доверять тебе, то обязательно захочет похвастаться новейшей "
            "боевой машиной и отвезет тебя на космодром. Там ты проберешься к крейсеру, "
            "незаметно установишь на нем пару бомб и сразу свалишь оттуда. "
            "И смотри не проболтайся, что знаешь о строительстве корабля, "
            "иначе Кацап сразу заподозрит неладное."
        ),
        "choices": [
            {"text": "У меня нет вопросов. Давай приступим к делу", "next": "accepted",
            "gives": {"money": 1000, "days": 3, "flags": {"timer_started": True}}},
            {"text": "Ты пойдешь со мной на задание?", "next": "rusman_and_who", "condition": {"flag_absent": "asked_who"}, "gives": {"flags": {"asked_who": True}}},
            {"text": "Что известно о космодроме?", "next": "rusman_and_cosmodrom", "condition": {"flag_absent": "asked_cosmodrom"}, "gives": {"flags": {"asked_cosmodrom": True}}},
            {"text": "Как завоевать доверие Кацапа?", "next": "rusman_and_katap", "condition": {"flag_absent": "asked_katap"}, "gives": {"flags": {"asked_katap": True}}},
            {"text": "Что делать, если меня раскроют?", "next": "rusman_and_return", "condition": {"flag_absent": "asked_return"}, "gives": {"flags": {"asked_return": True}}},
            {"text": "Когда крейсер будет запущен в космос?", "next": "rusman_and_cruser", "condition": {"flag_absent": "asked_cruiser"}, "gives": {"flags": {"asked_cruiser": True}}},
            {"text": "Отказываюсь от такого опасного задания! Плевать мне на кредиты", "next": "rusman_and_cancel"},
        ],
    },

    "accepted": {
        "title": "Гнездо пиратов",
        "text": (
            "- Вот и отлично, {player_name}. Все бы такие сговорчивые были, а то уже три кандидата отказались... "
            "Вы поднялись, и направились было к выходу, но Русман окликнул вас. Он нервно шарил в карманах. "
            "Достав какую-то бумажку, он сунул ее вам в руки. Это оказалась купюра в 1000 рублей. "

            "- Кредиты они не любят, а это самая крепкая валюта в здешних краях, - объяснил Русман, "
            "- говорят, из дерева сделана... У тебя 3 дня на выполнение задания! "
            "Поторопись! На тебя вся надежда! Удачи! "

            "Вы быстро добежали до корабля и запустили синхродвигатели. "
            "Голубая атмосфера за бортом начала быстро бледнеть, превращаясь в угрюмую черноту космоса. "
            "Прямо перед вами две луны этой планеты. Куда полетим?"
        ),
        "choices": [
            {"text": "Лететь к первой луне планеты", "next": "first_moon"},
            {"text": "Лететь ко второй луне планеты", "next": "second_moon"},
        ],
    },

    "first_moon": {
        "title": "Гнездо пиратов",
        "text": (
            "Первая луна была почти необитаемой: шахтерские селения по тысяче жителей были не в счет. "
            "Космопорт отсутствовал, поэтому вы посадили корабль на пористый грунт на окраине городка. "
            "Унылое зрелище! Грязные шахтеры, редкие магазины и стальные дома, нищета и грязь вокруг. "
            "Никакого бара и в помине не видно. Вы поняли, что залетели не туда... но надо что-то делать."
        ),
        "choices": [
            {"text": "Зайти в какой-нибудь дом", "next": "moon_house"},
            {"text": "Зайти в шахтерский магазин", "next": "moon_shop"},
            {"text": "Взлететь со спутника и направиться ко второй луне", "next": "second_moon"},
        ],
    },

    "moon_house": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы подергали ручку одной двери, затем другой, третьей, но все двери оказались запертыми. "
            "Только время зря потеряли..."
        ),
        "choices": [
            {"text": "Вернутся к своему кораблю", "next": "first_moon"},
        ],
    },

    "moon_shop": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы зашли в тускло освещенный магазинчик. Чего здесь только нет для шахтеров: "
            "буры, кирки, дроиды для глубинных раскопок, бомбы для взрывов грунта. "
            "Ценники были написаны от руки."
        ),
        "choices": [
            {"text": "Купить бомбу (200 рублей)", "next": "buy_boom",
            "condition": {"flag_absent": "has_license", "inventory_absent": "bomb"}},
            {"text": "Купить бомбу (200 рублей)", "next": "buy_boom_ok",
            "condition": {"flag_present": "has_license", "money_at_least": 200, "inventory_absent": "bomb"},
            "gives": {"money": -200, "inventory": {"bomb": 1}, "flags": {"has_license": False}}},
            {"text": "Купить дроида (50 рублей)", "next": "buy_droid",
            "condition": {"inventory_absent": "droid", "money_at_least": 50},
            "gives": {"money": -50, "inventory": {"droid": 1}}},
            {"text": "Купить бур (25 рублей)", "next": "buy_drill",
            "condition": {"inventory_absent": "drill", "money_at_least": 25},
            "gives": {"money": -25, "inventory": {"drill": 1}}},
            {"text": "Купить кирку (15 рублей)", "next": "buy_pickaxe",
            "condition": {"inventory_absent": "pickaxe", "money_at_least": 15},
            "gives": {"money": -15, "inventory": {"pickaxe": 1}}},
            *EXIT_SHOP
        ],
    },

    "buy_boom": {
        "title": "Гнездо пиратов",
        "text": (
            "- У вас есть лицензия шахтера? Нет? Ну, тогда и бомбу вам не можем продать - "
            "запрещено законами планеты Полуось! - огорчился продавец. - Может, вам нужно что-то еще?"
        ),
        "choices": EXIT_SHOP
    },

    "buy_boom_ok": {
        "title": "Гнездо пиратов",
        "text": (
            "- Давайте вашу лицензию шахтера... Вот ваша бомба, смотрите аккуратнее с ней - хранить в темноте, свыше \"50 градусов не нагревать!\""
            "Продавец протянул вам единственную бомбу, которая была в этом магазине. Вы быстро спрятали ее в рейнджерскую куртку."
        ),
        "choices": [
            {"text": "Выйти из магазина", "next": "exit_shop_moon_end"},
        ],
    },

    "exit_shop_moon_end": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы вышли из магазина. Единственное достойное занятие на этой нищей луне - как вам показалось - это рассматривание старых потертых бомб."
 
            "Так или иначе, но делать здесь больше нечего. Нужно возвращаться к выполнению задания. "
        ),
        "choices": [
            {"text": "Взлететь со спутника и направиться ко второй луне", "next": "second_moon"},
        ],
    },

    "buy_droid": {
        "title": "Гнездо пиратов",
        "text": (
            "- Спасибо за покупку! Вот ваш дроид. "
            "Кстати, что-то вы богато одеты для местного жителя. "
            "Странно... ну ладно, может вам нужно что-то еще? "
        ),
        "choices": [
            {"text": "Купить что-то ещё", "next": "moon_shop"},
            *EXIT_SHOP
        ],
    },

    "buy_drill": {
        "title": "Гнездо пиратов",
        "text": (
            " - Спасибо за покупку! Отличный бур, по метру в день бурит!"
            " Во до чего техника дошла! Может, вам нужно что-то еще? "
    
        ),
        "choices": [
            {"text": "Купить что-то ещё", "next": "moon_shop"},
            *EXIT_SHOP
        ],
    },

    "buy_pickaxe": {
        "title": "Гнездо пиратов",
        "text": (
            "  - Спасибо за покупку! Кирка из чистого титана! "
            "Правда, из обычного, на нержавеющий титан денег нет, - с этими словами продавец протянул "
            "вам ржавый металлический кусок, который гордо назывался киркой. - Может, вам нужно что-то еще?"
    
        ),
        "choices": [
            {"text": "Купить что-то ещё", "next": "moon_shop"},
            *EXIT_SHOP
        ],
    },

    "exit_shop_moon": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы вышли из магазина. Какой-то грязный пеленг прячется за углом магазина... "
        ),
        "choices": [
            {"text": "Подойти к пеленгу", "next": "peling_talk"},
            {"text": "Зайти в какой-нибудь дом", "next": "moon_house"},
            {"text": "Лететь ко второй луне планеты", "next": "second_moon"},
            {"text": "Зайти в шахтерский магазин", "next": "moon_shop"},
        ],
    },

    "peling_talk": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы подошли к странному пеленгу-шахтеру. Тот страшно обрадовался вам и стал шепелявить вам на ухо: "
            " - Слушай, рейнджер, помоги несчастному шахтеру в этой грязной дыре... "
        ),
        "choices": [
            {"text": "Держи 100 рублей, и расскажи мне кое-что", "next": "get_100_rub",
            "condition": {"money_at_least": 100},
            "gives": {"money": -100}},
            {"text": "Держи 5 рублей, хватит?", "next": "get_5_rub",
            "condition": {"money_at_least": 5},
            "gives": {"money": -5}},
            {"text": "Чем тебе помочь?", "next": "get_question"},
            {"text": "У меня нет для тебя денег, оборванец!", "next": "no_mouny"},
        ],
    },

    "get_100_rub": {
        "title": "Гнездо пиратов",
        "text": (
            " Отдав деньги шахтеру, вы принялись намекать про \"большой ба-бах!\". Пеленг понял вас на полуслове: "
            "- У Цишки есть бомба, есть бомба! Покупай, всего 500 руб! Покупай! "
            "Вы призадумались: пеленг просил дороже, чем в магазине..."
        ),
        "choices": [
            {"text": "Купить бомбу за 500 рублей", "next": "get_boomb_and_go",
            "condition": {"money_at_least": 500}},
            {"text": "Оставить пеленга и лететь ко второй луне", "next": "second_moon"},    
        ],
    },

    "get_boomb_and_go": {
        "title": "Гнездо пиратов",
        "text": (
            " Пеленг выхватил у вас из рук деньги и протянул изношенную шахтерскую бомбу, "
            "при этом крича \"Цишка улетит отсюда!\". Вы надежно положили ее в безопасное место - вдруг понадобится. "
            "Решив больше здесь не задерживаться, вы вернулись на корабль и поднялись над этим нищим спутником, направляясь ко второй луне планеты. "
        ),
        "choices": [
            {
                "text": "Лететь ко второй луне",
                "next": "second_moon",
                "gives": {"money": -500, "inventory": {"bomb": 1}},
            },
        ],
    },

    "get_5_rub": {
        "title": "Гнездо пиратов",
        "text": (
            "Пеленг дико обрадовался, видно его зарплата была намного меньше, "
            "и побежал в трущобы, даже не поблагодарив вас. Вот невоспитанный хрякохлюп! "
            "Так или иначе, делать здесь было больше нечего, и вы решили покинуть это место."
        ),
        "choices": [
            {"text": "Лететь ко второй луне планеты", "next": "second_moon"},     
        ],
    },

    "get_question": {
        "title": "Гнездо пиратов",
        "text": " - Понимаешь, - заныл пеленг, - мой дружбан вчера переехал на другие шахты, а заодно прихватил все мое оборудование, вор зеленобрюхий! А без него работать - это все равно что море ложкой хлебать... Правда, этот тупица свою лицензию шахтера забыл... ну, вернее, я помог ее забыть... - пеленг хитро подмигнул. - Купи мне кирку, бур и дроида, а я тебе лицензию взамен, а?.",
        "choices": [
            {
                "text": "Ладно, помогу тебе, только никуда не уходи (идти в магазин)",
                "next": "moon_shop",
                "condition": {"inventory_not_has_all": ["drill", "pickaxe", "droid"]},
            },
            {
                "text": "Да, я купил все, что нужно. Давай лицензию!",
                "next": "get_license",
                "condition": {"inventory_has_all": ["drill", "pickaxe", "droid"]},
                "gives": {
                    "inventory": {"drill": -1, "pickaxe": -1, "droid": -1},
                    "flags": {"has_license": True},
                },
            },
            {
                "text": "Нет, я не буду тебе помогать. Тороплюсь сильно, пора лететь мне... (покинуть спутник)",
                "next": "second_moon",
            },
        ],
    },

    "get_license": {
        "title": "Гнездо пиратов",
        "text": "- Опаньки, рейнджер! Да у тебя есть все оборудование, которое мне надо. Держи лицензию шахтера,"       "мне работать пора! "
                "Пеленг подхватил у вас все вещи тремя руками, а четвертой пихнул лицензию вам в карман, после " "чего засеменил прочь. "
                "Что ж, теперь можно и бомбой затариться.",
        "choices": [
            {"text": " Идти в магазин", "next": "moon_shop" },
        ],
    },

    "no_mouny": {
        "title": "Гнездо пиратов",
        "text": (
            " - Ах так, - вскричал пеленг, - тогда я тебя убью, а деньги все равно получу! "
            "Пеленг выхватил ручное черпало и угрожающе замахнулся. Правда, бойцом он был никудышным, "
            "и вы быстро его одолели. Решив больше здесь не задерживаться, вы вернулись на корабль "
            "и поднялись над этим нищим спутником, направляясь ко второй луне планеты."
        ),
        "choices": [
            {"text": "Лететь ко второй луне планеты", "next": "second_moon"},    
        ],
    },

    "rusman_and_who": {
        "title": "Гнездо пиратов",
        "text": (
            "- Эээ... нет, Кацап знает меня в лицо. "
            "Я обеспечу тебе отступление, когда ты установишь бомбы "
            "на крейсер и покинешь космодром прежде, чем на вас рухнет его крыша. "
            "Только сначала ты должен разузнать, где именно находится этот космодром. "
            "И запомни, нужно установить не менее двух бомб! "
            "Раздобудь их где-нибудь или сделай сам из таймера, детонатора "
            "и взрывчатки, ты же пират, {player_name}."
        ),
        "choices": BACK_TO_RUSMAN,
    },

    "rusman_and_cosmodrom": {
        "title": "Гнездо пиратов",
        "text": (
            "- Космодром спрятан где-то в недрах под поверхностью второй луны этой планеты, - начал Русман. "
            "Но нам известна одна деталь: основные конструкции космодрома заминированы. "
            "После запуска корабля детонаторы сработают, и... "
            "космодром превратится в братскую могилу для всех, кто связан с производством "
            "корабля - этот хитрый Кацап не хочет оставлять свидетелей. "
        ),
        "choices": BACK_TO_RUSMAN,
    },

    "rusman_and_katap": {
        "title": "Гнездо пиратов",
        "text": (
            " Кацап, самолично ограбивший несколько сотен торговцев и отсидевший почти во всех"
            " тюрягах нашей Галактики, уважает настоящих пиратов, их привычки и законы. "
            "Он с радостью заведет знакомство с таким же как он, поэтому мы тебя и позвали, {player_name}. "
            "Осталось только доказать Кацапу, что ты такой же отпетый негодяй, хе-хе, уж постарайся! "
 
            "По данным личного биографа Кацапа - гаальца Нааклю Ко - мы также узнали, "
            "что он, как и большинство пеленгов - большой любитель спиртного. "
            "Напоив Кацапа до нужной кондиции, можно выудить из него много полезной информации. "
            "Больше всего он любит рахишианскую \"Болотную ряску\". "
            "По межгалактическому договору ее запрещено продавать в барах, "
            "поэтому найди где-нибудь рецепт ряски и приготовь сам. "
            "Этот пеленг мало что смыслит в приготовлении ряски, но вот оценить ее "
            "вкус может не хуже автодегустатора. И, поверь, он будет обожать тебя "
            "до конца своих дней, если ты сможешь уважить его настоящей \"Ряской\"! "
        ),
        "choices": BACK_TO_RUSMAN,
    },

    "rusman_and_return": {
        "title": "Гнездо пиратов",
        "text": (
            " - Хмм... Если тебя раскроют, скажу сразу - вряд ли ты выйдешь оттуда живым. Так что будь осторожен. "
            "В крайнем случае, бросай задание и спасайся. "
        ),
        "choices": BACK_TO_RUSMAN,
    },

    "rusman_and_cruser": {
        "title": "Гнездо пиратов",
        "text": (
            "- Хорошо, что спросил. А то я забыл сказать, что сейчас агенты Дзухаллага "
            "проводят последние проверки, которые займут ровно три дня. "
            "Если ты не успеешь, то их корабль взлетит, и тогда нам всем керд... в общем, поторопись, {player_name}!"
        ),
        "choices": BACK_TO_RUSMAN,
    },

    "rusman_and_cancel": {
        "title": "Гнездо пиратов",
        "text": (
            "Русман посмотрел на вас, а затем с усмешкой сказал: "
            "- Четвертый... Ты четвертый по счету кандидат, который отказался, я даже не удивлен. "
            "Пират нынче не тот пошел... Прощай, {player_name}. "
            "Вы попрощались с агентом и вернулись в свой космолет. "
            "Жаль только, что кредитов вы уже не получите.. "
        ),
       "choices": []
    },

    "second_moon": {
        "title": "Гнездо пиратов",
        "text": (
            " Вторая луна - аграрная база планеты Полуось - встретила вас довольно приветливо: чистая атмосфера, солнце, теплый климат и бескрайние оранжевые равнины, пересеченные каменными стенами - памятником давно исчезнувшей цивилизации. Вы приземлились на посадочной площадке небольшого космопорта крупнейшего (и единственного!) города этого спутника и вышли на улицу. Прямо напротив зала для ожидающих находится какой-то бар, где может сидеть посыльный Кацапа. Надо бы туда сходить."
        ),
        "choices": [
            {"text": "Идти в бар", "next": "moon_bar"},        
        ],
    },

    "moon_bar": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы зашли в бар, в котором сидела куча народу. "
            "Побродив между столиками, внимательно рассматривая посетителей, вы заметили в дальнем углу понурую фигуру пеленга. Скорее всего, это и был посыльный Кацапа, потому что других пеленгов, да еще таких пьяных, в баре больше не было! Надо бы проверить свою догадку. "
            "Вы подошли к пеленгу, а он, увидев вас, нетрезво выговорил: "
            " - Хе-хе, ик... ну и рожа у тебя, дядя! Ты кто, ик, такой???"
        ),
        "choices": [
            {"text": "Пират {player_name} к вашим услугам", "next": "im_ranger"},  
            {"text": "Я Корсар Череп, не узнал меня?! Или тебе по репе настучать, чтоб вспомнил???", "next": "im_skull"},            
        ],
    },

     "im_ranger": {
        "title": "Гнездо пиратов",
        "text": (
            "  - Я тебя, ик... не знаю, ик! Проваливай, рагобамская ты жаба, а не то Кацапу позвоню... - и пеленг начал не спеша искать свой видеофон.  "
            "Вы поняли, что перед вами действительно посыльный Кацапа, и напустили на себя важности. "
            "- Ах ты лепрас недоделанный, если будешь так обращаться к великому и ужасному Корсару Черепу, "
            "то я " "тебе сейчас пощечин надаю!!! "
            "На пеленга ваши слова не произвели никакого впечатления. "
            "- Корсар Череп, ик?.. Великий и ужасный?.. Ой, не смеши мои п-перепонки, - посыльный явно издевался " 
            "над вами, - но ты на него, ик... как-то не очень с-смахиваешь..."
            "Сыграть Черепа у вас получилось не очень. Но пеленг все же решил предупредить Кацапа о вас, и потому" 
            "набрал его номер на видеофоне. Он о чем-то долго трепался заплетающимся языком, с недоверием " 
            "поглядывая в вашу сторону. Наконец он закончил и крикнул:"
            "- Босс приехал и ждет тебя снаружи, герой... ик..."
            
            "Осталось встретить Кацапа."
        ),
        "choices": [
            {"text": "Выйти на улицу", "next": "katsap", "gives": {"trust": {"Kacap": +26}}},  
        ],
    },

    "im_skull": {
        "title": "Гнездо пиратов",
        "text": (
            "Пеленг аж подпрыгнул на месте от ужаса, и мгновенно протрезвел. "
            "- Я... я... извините, владыка Череп, я как раз вас дожидаюсь... Пощадите!! Я позвоню боссу, только  " 
            "не... - посыльный верхней парой рук обхватил голову, а нижние сложил вместе в молящем жесте. "
            "- Звони быстрее! - и вы угрожающе нависли над пеленгом. Сыграть Черепа получилось как нельзя лучше. " 
            "Пеленг быстро переговорил с Кацапом о вашем прибытии, а потом еще долго что-то ему рассказывал, то "
            " и дело косясь испуганными глазами на вас. Наконец он пролепетал: "
            "- Босс приехал, ждет вас снаружи, сэр, прощайте... хорошо, что вы так быстро приехали, и еще раз "
            "извините..."
 
        "Осталось встретить Кацапа."
        ),
        "choices": [
            {"text": "Выйти на улицу", "next": "katsap",  "gives": {"trust": {"Kacap": +33}}},  
        ],
    },

    "katsap": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы вышли из бара и увидели Кацапа. Крепкий пеленг в окружении двух верзил-малоков стоял возле шикарного аэрокара люкс класса, затонированного вглухую. На капоте спереди вы рассмотрели золотую статуэтку лягушки, устремляющейся вперед. Кацап определенно любит классные тачки, это стоит взять на заметку. "
 
            "- Это ты Череп? - Кацап пристально смотрел на вас, - что-то не очень на него похож... "
            " Вас пробил холодный пот. Нужно срочно что-то сказать!"
        ),
       "choices": [
            {
                "text": "Эээ... ммм... Конечно я! Забыл уж меня, давненько не встречались...",
                "next": "drink_battle_no_memory",
                "gives": {"trust": {"Kacap": -1}},
            },
            {
                "text": "Да Череп я, Череп... А вы кого-то другого ждете?",
                "next": "drink_battle_skull",
                "gives": {"trust": {"Kacap": +5}},
            },
            {
                "text": "Ты посмел выразить свое недоверие великому Корсару Черепу?!!",
                "next": "drink_battle_low_respect",
                "gives": {"trust": {"Kacap": -5}},
            },
        ],
    },

    "drink_battle_no_memory": {
        "title": "Гнездо пиратов",
        "text": (
            " - Да у тебя память что ли отшибло астероидом? Я с тобой вообще раньше не встречался. "
            "- И точно, я тебя с другим пиратом Гацапой перепутал... "
            "Ваша ложь только насторожила босса. Надо было придумать что-нибудь правдоподобное заранее, а не " "говорить что попало сейчас..."
 
            "Тем временем быстро темнело, и пираты засобирались на базу. "
            "- Ехать довольно далеко, - процедил Кацап, - поэтому предлагаю махнуть по маленькой. Ты как? -" 
            "пеленг протянул вам бутылку с каким-то пойлом."
        ),
        "choices": DRINK_CHOICES,
    },

    "drink_battle_skull": {
        "title": "Гнездо пиратов",
        "text": (
            "- Да нет, корсар, только тебя и ждем. "
 
            " Тем временем быстро темнело, и пираты засобирались на базу. "
            " - Ехать довольно далеко, - процедил Кацап, - поэтому предлагаю махнуть по маленькой. Ты как? - и пеленг" "протянул вам бутылку с каким-то пойлом."
        ),
       "choices": DRINK_CHOICES,
    },

    "drink_battle_low_respect": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы неожиданно получили крепкий удар в челюсть. "
            "- Не вздумай мне так больше отвечать! Не такой уж ты и великий, видали мы и покруче. Потом тебя проверю... "
            "- Хорошо босс, я учту на будущее, - ответили вы, потирая лицо. "
  
            "Тем временем быстро темнело, и пираты засобирались на базу. "
            "- Ехать довольно далеко, - процедил Кацап, - поэтому предлагаю махнуть по маленькой. Ты как? - и пеленг протянул "
            "вам бутылку с каким-то пойлом."
        ),
        "choices":DRINK_CHOICES,
    },

    "drink_hard": {
        "title": "Гнездо пиратов",
        "text": (
            "- Эй, ты!!! - рассердился Кацап. - Ни один настоящий пират у своего собрата последнего не возьмет, а ты всю втыкиллу вылакал! Ты мне теперь три бутылки должен."
        ),
        "choices": [
            {
                "text": "Три бутылки? Ладно, как скажешь, потом достану где-нибудь", "next": "new_nick"
            },         
        ],
    },

    "drink_middle": {
        "title": "Гнездо пиратов",
        "text": (
            " - Хо-хо, смотрю, тебе понравилось! Это и правда лучшая втыкилла в галактике."
        ),
        "choices": [
            {
                "text": " Ага... Иккк!!", "next": "new_nick"
            },         
        ],
    },

    "drink_low": {
        "title": "Гнездо пиратов",
        "text": (
            "- Ну, как тебе местная втыкилла?"
        ),
        "choices": [
            {
                "text": "Как-то не очень", "next": "new_nick"
            },         
        ],
    },

    "no_drink": {
        "title": "Гнездо пиратов",
        "text": (
            "- Я не понимаю, - удивился Кацап, - ты пират или портянка? С каких пор ты не пьешь, Череп?"
        ),
        "choices": [
            {
                "text": "А ну это... ну горло болит... да-да, горло чего-то болит, не могу пить", "next": "new_nick"
            },         
        ],
    },

    "new_nick": {
        "title": "Гнездо пиратов",
        "text": (
            "- Слышь, пират, - снова обратился к вам босс, - тебе надо кличку дать, для конспирации, у нас все под кличками ходят. К тому же, не модно сейчас  \"Черепами \" зваться. Могу и сам тебе придумать, но, может, у тебя варианты подходящие есть?"
        ),
        "choices": NICK_CHOICES,
    },

    "nick_lohness": {
        "title": "Гнездо пиратов",
        "text": "Кацап поморщился: «Что за дурацкая кличка? Тебя уважать никто не будет. Давай ещё варианты!»",
        "choices": NICK_CHOICES,
    },
    "nick_kosyak": {
        "title": "Гнездо пиратов",
        "text": "- Да ты что?! Я ж тебе с такой кличкой ни одного дела не поручу. Давай другие варианты!",
        "choices": NICK_CHOICES,
    },
    "nick_dub": {
        "title": "Гнездо пиратов",
        "text": " - Да какой из тебя громила? Подкачайся лучше. Давай еще варианты!",
        "choices": NICK_CHOICES,
    },

    "nick_player_name": {
        "title": "Гнездо пиратов",
        "text": "- А что, вроде неплохо звучит! Да и тебе подходит, хороший вариант! "
        "Кацап сел в свой супер аэрокар и жестом показал вам следовать за ним. "
        "- Так, {player_name}, устал я сегодня, сейчас на базу едем, там все расскажу, а пока не тревожь меня, - и босс откинулся на сиденье. "
        "Вы сели в машину следом, по бокам к вам подсели малоки-телохранители, аэрокар приподнялся и полетел, быстро набирая скорость.",
        "choices": CAR_CHOICES
    },
    "nick_paranoic": {
        "title": "Гнездо пиратов",
        "text": " - Ха-ха-ха! Эта кличка меня с ума сведет!!! Давай еще варианты!",
        "choices": NICK_CHOICES,
    },
    "nick_dryn": {
        "title": "Гнездо пиратов",
        "text": " - Дрын Бывалый? Дрын... Дрын... Дык у меня уже есть такой человек! Давай еще варианты!",
        "choices": NICK_CHOICES,
    },
    "nick_self": {
        "title": "Гнездо пиратов",
        "text": " - Ага, а самому слабо? - спросил Кацап. - Ну ладно... э... сейчас модно, говорят, по именам рейнджеров зваться. "
        "Принимай кличку {player_name}, Череп. "
 
        "Кацап сел в свой супер аэрокар и жестом показал вам следовать за ним. "
        " - Так, {player_name}, устал я сегодня, сейчас на базу едем, там все расскажу, а пока не тревожь меня, - и босс откинулся на сиденье."
        " Вы сели в машину следом, по бокам к вам подсели малоки-телохранители, аэрокар приподнялся и полетел, быстро набирая скорость.", 
        "choices": CAR_CHOICES
    },

    "asc_about_car": {
        "title": "Гнездо пиратов",
        "text": (
            " - Классная у тебя тачка! - как бы невзначай обронили вы. "
            "- Это точно, - Кацап оживился, - лично выбирал! Раритетный вариант 2959 года. На этой луне таких ни у кого больше нет, - с гордостью ответил пеленг."
            "- А какой момент распада ядра в движке? - вы напрягли память, чтобы вспомнить, по какому принципу работают эти старые двигатели."
            "- 6000 наноджоулей!! Оценил теперь мою красавицу? - пеленгу явно понравился ваш вопрос."
            "Проговорив с Кацапом еще 2 часа, вы узнали все о его любимом каре."
 
            "Когда тема исчерпалась, вы откинулись на мягкое кресло и уставились в окно. Город остался позади, и перед вами проплывали бескрайние пейзажи местных равнин. "
            "Незаметно для себя вы уснули."
        ),
        "choices": [
            {"text": "Проснуться", "next": "mail", "gives": {"days": -1}},  
        ],
    },

    "no_action": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы откинулись на мягкое кресло и уставились в окно. Город остался позади, и перед вами проплывали бескрайние пейзажи местных равнин."
            "Незаметно для себя вы уснули."
        ),
        "choices": [
            {"text": "Проснуться", "next": "mail", "gives": {"days": -1}},  
        ],
    },

    "more_question": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы окликнули Кацапа: "
            "- У меня пара вопросов про... "
            "- Ты что, тупой? Я же просил не беспокоить, - резко оборвал вас Кацап. "
            "Дальше продолжать разговор смысла не было. Вы откинулись на мягкое кресло и уставились в окно. Город остался позади, и перед вами проплывали бескрайние пейзажи местных равнин. "
            "Незаметно для себя вы уснули." 
        ),
        "choices": [
            {"text": "Проснуться", "next": "mail", "gives": {"days": -1}},  
        ],
    },

    "mail": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы нехотя открыли глаза, потянулись пару раз и поняли, что находитесь в какой-то жилой комнате. "
            "Похоже, это пеленгский особнячок. Укрытие для пиратов, залегших на дно, или проводивших, как Кацап, секретную деятельность. "
            "На тумбочке вы увидели записку. Взяв ее, вы прочли: "
 
            "{player_name}, ты задремал во время поездки, да так крепко, что мы не смогли разбудить тебя, и моим ребятам пришлось "
            "дотащить тебя до комнаты. За доставку - 100 рублей! Шутка. Теперь комната твоя, распоряжайся как хочешь. "
            "Как проснешься, зайди ко мне. Я буду в своей комнате."
                                                                                                                             
            "Кацап" 
        ),
        "choices": [
            {"text": "Покинуть комнату", "next": "corridor"},  
        ],
    },

    "corridor": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы в широком коридоре, который оканчивается лестницей в дальнем углу. Напротив вас есть двери в другие комнаты. На каждой двери - надпись с кличкой пирата, проживающего в ней. В одной из комнат даже живет малок, о чем свидетельствует проломанная при попытке написать имя дверь. Кацап живет в первой комнате от лестницы. На этой двери висит красная надпись в ярко-золотом обрамлении - цвета Дзухаллага."
        ),
        "choices": [
          {"text": "В комнату Кацапа", "next": "katsap_room_first",
            "condition": {"flag_absent": "katsap_met"},
            "gives": {"flags": {"katsap_met": True}}},

            {"text": "В комнату Кацапа", "next": "katsap_room_low",
            "condition": {"flag_present": "katsap_met",
                        "trust_below": {"name": "Kacap", "value": 30}}},

            {"text": "В комнату Кацапа", "next": "katsap_room_empty",
            "condition": {"flag_present": "katsap_met",
                        "trust_at_least": {"name": "Kacap", "value": 30},
                        "trust_below": {"name": "Kacap", "value": 45}}},

            {"text": "В комнату Кацапа", "next": "katsap_room_high",
            "condition": {"flag_present": "katsap_met",
                        "trust_at_least": {"name": "Kacap", "value": 70}}},

            {"text": "В комнату Кацапа", "next": "katsap_room_mid",
            "condition": {"flag_present": "katsap_met",
            "trust_at_least": {"name": "Kacap", "value": 45},
            "trust_below": {"name": "Kacap", "value": 70}}},
            {"text": "В свою комнату", "next": "my_room"}, 
            {"text": "Походить по другим комнатам ", "next": "other_room"}, 
            {"text": "Спуститься вниз по лестнице", "next": "first_floor"},    
        ],
    },

    "first_floor": {
        "title": "Гнездо пиратов",
        "text": (
            "Узкий неосвещенный коридор первого этажа оканчивается тремя выходами. Напротив вас автоматическая дверь в зал. Слева столовая, из которой можно попасть на кухню. Справа виден выход на задний двор."
        ),
        "choices": [
            {"text": "В зал", "next": "kino_room"}, 
            {"text": "В столовую", "next": "eat_room"}, 
            {"text": "Подняться вверх по лестнице", "next": "corridor"}, 
           {"text": "На улицу", "next": "outside",
            "condition": {"inventory_has_all": ["card"],
            "flag_present": "read_recipe"}},
        ],
    },

    "outside": {
        "title": "Гнездо пиратов",
        "text": "Вы на заднем дворе за особняком. Чистая речка с ледяной водой, журчащая неподалеку; красивое болото, заботливо охраняемое пиратами; теплая оранжевая травка под ногами... Красота природы! Небольшая кладовка в трех метрах от вас, а также гараж аэрокаров неподалеку.",
        "choices": [
            {"text": "К речке", "next": "go_to_river"},
            {"text": "К болоту", "next": "go_to_swarm"},
            {"text": "В кладовую", "next": "go_to_storeroom"},
            {"text": "В гараж", "next": "go_to_garage"},
            {"text": "В дом", "next": "first_floor"},
        ],
    },

    "go_to_garage": {
        "title": "Гнездо пиратов",
        "text": " Гараж резко отличается от особняка: серые стены, холодные полибетонные колонны (даже не покрытые пластиком),"
        " грубый пол. В гараже стоят аэрокары, в том числе и тот, на котором вас привезли сюда. "
        "Под аэрокаром возится старый техник-фэянин."
        "- Не понимаю, - бормочет он, - кто колбы с кислотой тырит? Эти алкаши-пеленги, что ли? "
        "Уже надоело из личных запасов доставать..."
        "На стене висят инструменты для ремонта аэромашин, рядом с ними - полка с какими-то колбами. На полке надпись: \"КИСЛОТЫ\".",
        "choices": [
            {"text": "Подойти к полке", "next": "go_to_shelf"},
            {"text": "Во двор", "next": "outside"},
        ],
    },

    "go_to_shelf": {
        "title": "Гнездо пиратов",
        "text": (
            "Всего на полках 4 колбы. "
            "Мда... Осталось выбрать кислоту."
        ),
        "choices": [
            {"text": "Взять первую колбу - серная кислота", "next": "get_acid_false",
            "condition": {"flag_absent": "took_acid"},
            "gives": {"flags": {"took_acid": True}, "inventory": {"acid": 1}}},

            {"text": "Взять вторую колбу - изиодная кислота", "next": "get_acid_false",
            "condition": {"flag_absent": "took_acid"},
            "gives": {"flags": {"took_acid": True}, "inventory": {"acid": 1}}},

            {"text": "Взять третью колбу - угольная кислота", "next": "get_acid_true",
            "condition": {"flag_absent": "took_acid"},
            "gives": {"flags": {"took_acid": True, "true_acid": True},
                    "inventory": {"acid": 1}}},

            {"text": "Взять четвёртую колбу - азотная кислота", "next": "get_acid_false",
            "condition": {"flag_absent": "took_acid"},
            "gives": {"flags": {"took_acid": True}, "inventory": {"acid": 1}}},

            {"text": "Отойти от полки", "next": "go_to_garage"},
        ],
    },

   "get_acid_true": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы взяли третью колбу. Жидкость в ней слегка пахнет жжёным — "
            "точь-в-точь слабоконцентрированная угольная кислота из рецепта. "
            "Кажется, вам повезло."
        ),
        "choices": [
            {"text": "Отойти от полки", "next": "go_to_garage"},
        ],
    },

    "get_acid_false": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы взяли колбу. Жидкость пахнет как-то странно — не то растворитель, "
            "не то вода из-под крана. Вы не уверены, что это угольная кислота, "
            "но других колб без бирок всё равно не осталось."
        ),
        "choices": [
            {"text": "Отойти от полки", "next": "go_to_garage"},
        ],
    },

    "go_to_storeroom": {
        "title": "Гнездо пиратов",
        "text": " Вы у небольшой деревянной кабинки, имеющей на удивление современную дверь. Замок адаптирован под широко используемые магнитные карты. Рядом стоит пеленг, покручивая в руках ту самую магнитную карту.  \"Хы-хы, - подумали вы, - у меня своя карточка есть \", - и с довольным видом нащупали магнитку в кармане.",
        "choices": [
            {"text": "Вставить магнитную карту",
            "next": "set_card",
            "condition": {"inventory_has_all": ["card"]}},
            {"text": "Заговорить с пеленгом",
            "next": "spick_storeroom_peling"},
            {"text": "Отойти от кладовки",
            "next": "outside"},
        ],
    },

    "spick_storeroom_peling": {
        "title": "Гнездо пиратов",
        "text": "- Привет, зеленобрюхий! Как дела? - и вы панибратски похлопали его по плечу."
                "Пеленг не ожидал такой наглости:"
                "- Я не \"зеленобрюхий\", а Комер Сан. Ты тут просто так ошиваешься или по делу? Хочешь в кладовку, плати 500 рублей или давай что то за вход.",
        "choices": [
            {"text": "Получи свои 500 рублей, жадина!", "next": "post_500_rub",
            "condition": {"flag_absent": "post_500_rub", "money_at_least": 500},
            "gives": {"flags": {"post_500_rub": True}, "money": -500}},
            {"text":"Не собираюсь я платить тебе, ищи другого простака!", "next": "go_to_storeroom"},
            {
                "text": "Показать карточку с пеленгессами",
                "next": "set_photo_storeroom_peling",
                "condition": {"inventory_has_all": ["photo"], "flag_absent": "set_photo_storeroom_peling"},
                "gives": {
                    "inventory": {"photo": -1},
                    "flags": {"set_photo_storeroom_peling": True},
                    "trust": {"Kacap": -7}
                }
            },
        ],
    },

   "set_photo_storeroom_peling": {
        "title": "Гнездо пиратов",
        "text": (
            "Пеленг жадно схватил фотографию и открыл дверь. "
            "— Проходи, — сказал он, сделав всеми четырьмя руками приглашающий жест. "
            "Вы прошли в кладовку."
        ),
        "choices": [
            {"text": "Далее", "next": "set_card"},
        ],
    },

    "post_500_rub": {
        "title": "Гнездо пиратов",
        "text": (
            "Пеленг жадно схватил протянутые деньги и открыл дверь. "
            "— Проходи, — сказал он, сделав всеми четырьмя руками приглашающий жест. "
            "Вы прошли в кладовку."
        ),
        "choices": [
            {"text": "Далее", "next": "set_card"},
        ],
    },

    "set_card": {
        "title": "Гнездо пиратов",
        "text": "Вы в небольшой кладовке. Большую ее часть занимают банки из-под краски, в которых вы нашли заряды для бластеров, какие-то кислоты, непонятные пакетики с каким-то белым порошком, а также целый ряд бутылок чистого 99%-го спирта. Около двери стоит несколько пар хороших самогреющих сапог из мультипластика, для брожения в холодной воде..",
        "choices": [
            {"text":"Взять сапоги", "next": "set_boots", 
            "condition": {"flag_absent": "get_boots"},
            "gives": {"flags": {"get_boots": True},    
            "inventory": {"boots": 1}}},
            {"text":"Взять 99% спирт", "next": "set_spirt", 
            "condition": {"flag_absent": "get_spirt"},
            "gives": {"flags": {"get_spirt": True},    
            "inventory": {"spirt": 1}}},
            {"text": "Вернутся во двор", "next": "outside"},
        ],
    },

    "set_boots": {
        "title": "Гнездо пиратов",
        "text": "Вы выбрали сапоги своего размера и сразу их надели, чтоб подозрений не вызывать - будто вы всегда в них и ходили. Бред, конечно, ну не под мышкой же их выносить?!",
        "choices": [
            {"text":"Далее", "next": "set_card"},
        ],
    },

    "set_spirt": {
        "title": "Гнездо пиратов",
        "text": "Вы подошли к стеллажу поближе и, закрыв глаза, стали выбирать бутылку наугад. Взяв первую попавшуюся и проверив, что в ней действительно спирт, вы продолжили обдумывать свой план приготовления \"ряски\".",
        "choices": [
            {"text":"Далее", "next": "set_card"},
        ],
    },

    "go_to_swarm": {
        "title": "Гнездо пиратов",
        "text": " Болото красиво блестит на солнце Бетельгейзе. Оно хорошо обросло оранжевыми камышами и красными лилиеподобными цветами, с которых время от времени прыгают в воду трехногие лягушки. Из глубины камышей доносятся какие-то звуки местной фауны. Пеленг загорает на берегу, иногда закусывая водорослями.",
        "choices": [
            {"text":"Нарвать водорослей", "next": "get_flowers", 
            "condition": {"flag_absent": "get_flowers"},
            "gives": {"flags": {"get_flowers": True},    
            "inventory": {"flowers": 1}}},
            {"text":"Зачерпнуть болотной жижи", "next": "get_swarm_water", 
            "condition": {"flag_absent": "get_swarm_water"},
            "gives": {"flags": {"get_swarm_water": True},    
            "inventory": {"swarm_water": 1}}},
            {"text":"Во двор", "next": "outside"},
        ],
    },

    "get_swarm_water": {
        "title": "Гнездо пиратов",
        "text": "Вы нашли вязкий берег и вытащили заранее заготовленный для жижи стакан. Противная зеленовато-коричневая субстанция вскоре заполнила его до краев.",
        "choices": [
            {"text":"Искать оставшиеся компоненты", "next": "go_to_swarm"},
        ],
    },

    "get_flowers": {
        "title": "Гнездо пиратов",
        "text": " Вы с опасением подошли к камышам, у подножия которых, в теплой мутноватой воде, росли разветвляющиеся красно-оранжевые водоросли. Засунув руку в воду, вы вырвали целый клок водорослей и тут же выронили их от резкого возгласа загорающего пеленга:"
        "- Эээй!! Как ты посмел цапнуть мои любимые водоросли?! Ну-ка иди сюда!!",
        "choices": [
            {"text":"Подождать пеленга", "next": "wait_peling"},
            {"text":"Бежать в дом", "next": "outside", 
            "condition": {"flag_absent": "no_fight_peling"},
            "gives": {"flags": {"no_fight_peling": True}, "trust": {"Kacap": -5}}},
        ],
    },

    "wait_peling": {
        "title": "Гнездо пиратов",
        "text": (
            "Пеленг быстро направился к вам с явно недобрыми намерениями: "
            "— Ты какого мои водоросли рвешь? А?"
        ),
        "choices": [
            {"text":"Кто сказал, что они твои, лягва?!", "next": "fight_peling", 
            "condition": {"flag_absent": "fight_peling"},   
            "gives": {"flags": {"fight_peling": True}, "trust": {"Kacap": +12}}},
            {"text": "Постой, давай все мирно уладим. 150 рублей хватит?", "next": "post_150_rub",
            "condition": {"flag_absent": "post_150_rub", "money_at_least": 150},  # ✅
            "gives": {"flags": {"post_150_rub": True}, "money": -150}},
        ],
    },

    "post_150_rub": {
        "title": "Гнездо пиратов",
        "text": (
            "— Ладно, рви, только не много! — успокоился пеленг. "
            "Вы подошли к берегу. Пора нарвать, наконец, проклятых водорослей, "
            "которые достались вам не задарма."
        ),
        "choices": [
            {"text":"Нарвать водорослей", "next": "go_to_swarm"},
        ],
    },

    "fight_peling": {
        "title": "Гнездо пиратов",
        "text": " - А ну воткни траву на место! - с этими словами пеленг резко прыгнул на вас, пытаясь заехать двумя кулаками по лицу. Однако вы не ударили лицом в грязь, и, ловко увернувшись, точно саданули врага в челюсть. Пеленг дернулся и потерял сознание. Нужно что-то делать с ним.",
            "choices": [
                {"text":"Утопить пеленга в болоте", "next": "kill_peling", 
                "condition": {"flag_absent": "kill_peling"},
                "gives": {"flags": {"kill_peling": True}, "trust": {"Kacap": -13}}},
                {"text":"Оттащить пеленга к месту его отдыха", "next": "no_kill_peling", 
                "condition": {"flag_absent": "no_kill_peling"},
                "gives": {"flags": {"no_kill_peling": True},    
                "inventory": {"bomb": 1}, "trust": {"Kacap": +5}}},
        ],
    },

    "kill_peling": {
        "title": "Гнездо пиратов",
        "text": " Вы потащили бесчувственного лепрасового к берегу и подняли тело над собой... С громким плеском пеленг погрузился в болотную пучину... А что, нечего было наезжать на крутого рейнджера! Вот только Кацап в первую очередь вас заподозрит в пропаже одного из бандитов.",
        "choices": [
            {"text":"К берегу болота", "next": "go_to_swarm"},
            {"text":"Вернуться во двор", "next": "outside"},
        ],
    },

    "no_kill_peling": {
        "title": "Гнездо пиратов",
        "text": "  Вы взяли пирата за ногу и незаметно оттащили к месту его отдыха. Теперь издалека было сложно понять, спит он или лежит без сознания. Через пару минут пеленг очнулся, и, видя, что вы готовы к новой драке, стал извиняться за свое поведение, объясняя это действием спирта. Вы намекнули на возмещение ущерба..."
        "- Да-да, конечно, - быстро заговорил пират, - у меня тут где-то бомба есть! Подойдет?"
        "И, порывшись в кармане лежавшего возле него костюма, вытащил оттуда миниатюрное взрывное устройство. Вы помирились с пеленгом и забрали бомбу. Все хорошо, у Кацапа каждый бандит на счету, поэтому он оценит вашу гуманность.",
        "choices": [
            {"text":"К берегу болота", "next": "go_to_swarm"},
            {"text":"Вернуться во двор", "next": "outside"},
        ],
    },

    "go_to_river": {
        "title": "Гнездо пиратов",
        "text": " Журчание речки приятно ласкает ваш слух. Стайки рыбок-пирашек гоняют друг за другом. Эх, порыбачить бы сейчас..",
       "choices": [
            {"text": "Поболтать рукой в воде", "next": "need_boots",
            "condition": {"inventory_absent": "boots"}},

            {"text": "Поболтать рукой в воде", "next": "hast_boots",
            "condition": {"inventory_has_all": ["boots"]}},

            {"text": "Во двор", "next": "outside"},
        ],
    },

    "hast_boots": {
        "title": "Гнездо пиратов",
        "text": " Мальки, заслышав плеск воды от вашей руки, толпой ринулись к этому месту, предвкушая приличный обед. "
            "Вы вовремя отдернули руку от воды."
            "Ряска - достаточно сложный напиток, значит, нужен хороший мелкий песок. Как, например, на дне это чистой речушки. "
            "Но вода-то ужасно ледяная. Есть опасность простудиться и сильно заболеть или быть покусанным милыми рыбками, "
            "поэтому просто так в речку не войти. Хорошо, что у вас есть надежный друг в этих суровых "
            "краях - самогреющие сапоги из мультипластика. Можно спокойно входить в воду.",
        "choices": [
            {"text":"Включить сапоги и войти в речку", "next": "get_water", 
                        "condition": {"flag_absent": "get_water"},
                        "gives": {"flags": {"get_water": True},    
                        "inventory": {"water": 1, "sandy" : 1}}},
            {"text": "Отойти от речки", "next": "go_to_river"},
        ],
    },

    "get_water": {
        "title": "Гнездо пиратов",
        "text": " Вы смело вошли в воду в сапогах из мультипластика с самообогревом. Ногам было тепло как на гаальской планете Аафриика, и вы спокойно двигались дальше в ледяной воде. К тому же, сапоги показались пирашкам невкусными, и они потеряли к вам всякий интерес. Ваш труд был вознагражден - вскоре белый песок и вода оказались в ведерке.",
        "choices": [
            {"text": "Отойти от речки", "next": "go_to_river"},
        ],
    },

    "need_boots": {
        "title": "Гнездо пиратов",
        "text": " Мальки, заслышав плеск воды от вашей руки, толпой ринулись к этому месту, предвкушая приличный обед. Вы вовремя отдернули руку."
            "Ряска - достаточно сложный напиток, значит, нужен хороший мелкий песок. Как, например, на дне этой чистой речушки. Но вода-то ужасно ледяная. Есть опасность простудиться и сильно заболеть или быть покусанным милыми рыбками, поэтому просто так в речку не войти. Неплохо бы обзавестись самогреющими сапогами из мультипластика.",
        "choices": [
            {"text": "Отойти от речки", "next": "go_to_river"},
        ],
    },

    "eat_room": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы находитесь в столовой. Она не отличается от большинства других комнат. Только большой пластиковый стол и мягкие стулья занимают большую ее часть. На столе стоят недоеденные блюда с рыбами-трипаньями, водорослями и прочей пеленгской снедью."
        ),
        "choices": [
            {"text": "Приготовить себе поесть", "next": "self_cooking", 
            "condition": {"flag_absent": "self_cooking"},
            "gives": {"flags": {"self_cooking": True}, "trust": {"Kacap": +8}}}, 
            {"text": "Покушать остатки недоеденных блюд", "next": "eat_trash", 
            "condition": {"flag_absent": "eat_trash"},
            "gives": {"flags": {"eat_trash": True}, "trust": {"Kacap": -8}}},
            {"text": "На кухню", "next": "cooking_room"},
            {"text": "В коридор", "next": "first_floor"},
        ],
    },

    "eat_trash": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы начали копаться в объедках, стараясь найти наиболее вкусные. "
            "- Ням, как вкусно, ммм... - приговаривали вы во время еды. "
            "- Серьезно? - усомнился кто-то. Вы повернули голову, и кусок вывалился у вас изо рта: за этим позорным занятием вас застал проходивший мимо Кацап. Судя по его презрительному взгляду, его отношение к вам сильно упало. Вы дали себе клятву больше никогда не делать подобного."
        ),
        "choices": [
            {"text": "Вернутся к делу", "next": "eat_room"}, 
        ],
    },

    "self_cooking": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы вытащили все, что на ваш взгляд было нужно для готовки, и приготовили себе отличного супа из местных рыб и отфильтрованной речной воды. Наевшись вдоволь, вы решили вернуться к своему плану."
        ),
        "choices": [
            {"text": "Вернутся к делу", "next": "eat_room"}, 
        ],
    },

    "cooking_room": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы в кухне. Она заставлена новейшей бытовой техникой и всем, что нужно для приготовления самых экзотических блюд. Фэянин возле посудомоечного аппарата со скукой собирает вымытые тарелки. Из поломанного с прошлой гулянки крана капает вода. На столике стоит точнейший мини-анализатор, высчитывающий граммы до 0,00001. Вполне достаточно, чтобы приготовить любое современное блюдо. Рядом лежит кулинарная книга."
        ),
         "choices": [
            {"text": "Приступить к приготовлению напитка»",
            "next": "brew_ryaska",
            "condition": {"inventory_has_all": [
                "swarm_water", "sandy", "flowers", "spirt", "water", "acid"
            ]}},
            {"text": "Почитать кулинарную книгу", "next": "cooking_book"},
            {"text": "В столовую", "next": "eat_room"},
        ],
    },

   "brew_ryaska": {
        "title": "Гнездо пиратов",
        "text": "Вы у мини-анализатора. Пора смешать всё по рецепту.",
        "choices": [
            {"text": "Досыпать песка", "next": "post_sandy",
            "condition": {"flag_absent": "added_sandy",
                        "inventory_has_all": ["sandy"]}},

            {"text": "Добавить водорослей", "next": "post_flowers",
            "condition": {"flag_absent": "added_flowers",
                        "inventory_has_all": ["flowers"]}},

            {"text": "Долить кислоты", "next": "post_acid",
            "condition": {"flag_absent": "added_acid",
                        "inventory_has_all": ["acid"]}},

            {"text": "Долить спирта", "next": "post_spirt",
            "condition": {"flag_absent": "added_spirt",
                        "inventory_has_all": ["spirt"]}},

            {"text": "Долить воды", "next": "post_water",
            "condition": {"flag_absent": "added_water",
                        "inventory_has_all": ["water"]}},

            {"text": "Долить болотной жижи", "next": "post_swarm_water",
            "condition": {"flag_absent": "added_swarm_water",
                        "inventory_has_all": ["swarm_water"]}},

           {"text": "Помешать 10 минут на слабом огне и принести «ряску» Кацапу",
            "next": "brew_result",
            "condition": {"flags_all": [
                "added_sandy", "added_flowers", "added_acid",
                "added_spirt", "added_water", "added_swarm_water",
            ], "flag_absent": "ryaska_brewed"}},

            {"text": "Свериться с рецептом", "next": "see_recept"},
            {"text": "Выйти из кухни", "next": "cooking_room"},
        ],
    },

    "see_recept": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы придвинулись к галокниге. В легком голубоватом мерцании горел текст:"
 
            "...                  * * *"
 
            "Одна порция коктейля равна 100 мл."
 
                              "ПРИГОТОВЛЕНИЕ:"
 
            "Смешайте вышеуказанные компоненты в пропорциях: на одну пятую стакана воды долить одну пятую стакана болотной жижи и полстакана спирта. Добавьте 5 мл слабой угольной кислоты, чтобы придать напитку кисловато-жгучий вкус. Досыпьте столько же (около 2 г от общей массы напитка) песка и добавьте 3 г водорослей, затем помешивайте 10 минут на слабом огне и разливайте по бокалам. Ваши пеленгские гости будут рады такому угощению!"
 
            "Внимание! Никогда не добавляйте уже налитый компонент второй раз! Иначе напиток прокиснет и будет непригоден для употребления. "
 
            "___________________ стр. 1826 __________________"
        ),
        "choices": [
            {"text": "Вернуться к приготовлению напитка", "next": "brew_ryaska"}, 
            {"text": "Выйти из кухни", "next": "cooking_room"},
        ],
    },

   "post_sandy": {
        "title": "Гнездо пиратов",
        "text": "Вы загребли стакан песка. Сколько досыпать в котёл?",
        "choices": [
            {"text": "2 г.",  "next": "brew_ryaska",
            "gives": {"flags": {"added_sandy": True, "sandy_g": 2},
                    "inventory": {"sandy": -1}}},
            {"text": "5 г.",  "next": "brew_ryaska",
            "gives": {"flags": {"added_sandy": True, "sandy_g": 5},
                    "inventory": {"sandy": -1}}},
            {"text": "10 г.", "next": "brew_ryaska",
            "gives": {"flags": {"added_sandy": True, "sandy_g": 10},
                    "inventory": {"sandy": -1}}},
            {"text": "20 г.", "next": "brew_ryaska",
            "gives": {"flags": {"added_sandy": True, "sandy_g": 20},
                    "inventory": {"sandy": -1}}},
            {"text": "50 г.", "next": "brew_ryaska",
            "gives": {"flags": {"added_sandy": True, "sandy_g": 50},
                    "inventory": {"sandy": -1}}},
            {"text": "Передумать", "next": "brew_ryaska"},
        ],
    },

    "ryaska_ready": {
        "title": "Гнездо пиратов",
        "text": (
            "Напиток вышел на славу — в меру жгучий, в меру болотный. "
            "Кацап такое оценит. Пора нести."
        ),
        "choices": [{"text": "Отнести катцапу", "next": "post_raska_to_katsap_ready"}],
    },

    "ryaska_failed": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы попробовали — гадость редкостная. То ли кислоты не та, "
            "то ли пропорции перепутали. Такую «ряску» Кацап пить не станет. "
            "Ингредиенты потрачены зря — вторую порцию из чего варить, непонятно."
        ),
        "choices": [{"text": "Отнести катцапу", "next": "post_raska_to_katsap_no_ready"}],
    },

    "post_raska_to_katsap_no_ready": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы вошли в комнату босса. Кацап валялся на кровати и смотрел стереовизор: на экране шел какой-то брутальный боевик про нападение пеленгских террористов на гаальское посольство планеты Элиния, где находится одна из крупнейших дипломатических баз. Несчастные желтокожие гуманоиды звали на помощь, а пеленги прижаривали их бластерными зарядами к стенам."
            "- Привет, братан, - протянул Кацап. - Что надо?"
            "- Да вот, я подумал, может, ты \"Болотной ряски\" хочешь?"
            "Кацап ужасно обрадовался."
            "- Давно я не пил любимой ряски! Все под боком, а сделать некогда. Надеюсь, ты не хочешь меня отравить? - сказал неуверенно Кацап."
            "- Нет, - искренне сказали вы."
            "- Давай-ка посмотрим. Я знаю, какова ряска на вид, запах и цвет."
            "Кацап протянул правую нижнюю руку."
        ),
        "choices": [
            {"text": "Протянуть стакан",
            "next": "kill_katsap",
            "gives": {"inventory": {"ryaska": -1}}},         

            {"text": "Рвануть на кухню, оправдываясь...",
            "next": "brew_ryaska",
            "gives": {"trust": {"Kacap": -15}}},
        ],
    },

    "kill_katsap": {
        "title": "Гнездо пиратов",
        "text": (
            " Кацап забыл проверить ряску и выпил все, не пробуя. Судя по предсмертной агонии вашего босса, вы выбрали не ту кислоту. Теперь уже Кацап никому ничего не скажет. Вы сбежали с места преступления, сели в свой корабль и вернулись обратно на планету Полуось. Плакали ваши денежки"
        ),
        "choices": [],
    },

    "like_katsap": {
        "title": "Гнездо пиратов",
        "text": (
            " Кацап поводил пальцем в стакане, наморщился и сказал: "
            "- Эта ряска неправильно приготовлена... Ха-ха. Шучу, {player_name}! Все ты правильно сделал. А рецепт сложный, между прочим."
            "С этими словами Кацап отхлебнул немного, а затем не отрываясь опустошил стакан."
            "- Ух, хорошо пошла! Давненько я не баловался прекрасной ряской. Уважил ты меня,{player_name}! "
 
            "Пеленг протянул вам стакан и попросил отнести его на кухню."
        ),
        "choices": [
             {"text": "Занести стакан на кухню", "next": "cooking_room"},
        ],
    },

    "post_raska_to_katsap_ready": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы вошли в комнату босса. Кацап валялся на кровати и смотрел стереовизор: на экране шел какой-то брутальный боевик про нападение пеленгских террористов на гаальское посольство планеты Элиния, где находится одна из крупнейших дипломатических баз. Несчастные желтокожие гуманоиды звали на помощь, а пеленги прижаривали их бластерными зарядами к стенам."
            "- Привет, братан, - протянул Кацап. - Что надо?"
            "- Да вот, я подумал, может, ты \"Болотной ряски\" хочешь?"
            "Кацап ужасно обрадовался."
            "- Давно я не пил любимой ряски! Все под боком, а сделать некогда. Надеюсь, ты не хочешь меня отравить? - сказал неуверенно Кацап."
            "- Нет, - искренне сказали вы."
            "- Давай-ка посмотрим. Я знаю, какова ряска на вид, запах и цвет."
            "Кацап протянул правую нижнюю руку."
        ),
        "choices": [
                 {"text": "Протянуть стакан",
                    "next": "like_katsap",
                    "gives": {"trust": {"Kacap": +35},
                            "inventory": {"ryaska": -1},          
                            "flags": {"ryaska_given": True}}},  
            {"text": "Рвануть на кухню, оправдываясь: \"Кажется, я напутал с рецептом, сейчас новую \"ряску\" принесу!\"",
            "next": "brew_ryaska", "gives": {"trust": {"Kacap": -15}}}
        ],
    },

    "brew_result": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы помешали 10 минут на слабом огне, разлили по стаканам. "
            "Пахнет… вроде как надо. Но проверить можно только одним способом — попробовать."
        ),
        "choices": [
            {"text": "Попробовать и нести Кацапу",
            "next": "ryaska_ready",
            "condition": {
                "flag_present": "true_acid",
                "flags_exact": {
                    "sandy_g": 2, "flowers_g": 3, "acid_ml": 5,
                    "spirt_ml": 50, "water_ml": 20, "swarm_water_ml": 20,
                },
            },
            "gives": {"flags": {"ryaska_ok": True, "ryaska_brewed": True},
                   "inventory": {"ryaska": 1}}},

            {"text": "Попробовать и нести Кацапу (пахнет не так...)",
            "next": "ryaska_failed",
            "condition": {"flag_absent": "true_acid"},
            "gives": {"flags": {"ryaska_bad": True, "ryaska_brewed": True},
                   "inventory": {"ryaska": 1}}},

            {"text": "Попробовать и нести Кацапу (пахнет не так...)",
            "next": "ryaska_failed",
            "condition": {
                "flag_present": "true_acid",
                "flags_not_exact": {
                    "sandy_g": 2, "flowers_g": 3, "acid_ml": 5,
                    "spirt_ml": 50, "water_ml": 20, "swarm_water_ml": 20,
                },
            },
             "gives": {"flags": {"ryaska_bad": True, "ryaska_brewed": True},
                   "inventory": {"ryaska": 1}}},
        ],
    },

    "post_flowers": {
        "title": "Гнездо пиратов",
        "text": "Вы отделили горсть болотных водорослей. Сколько добавить в котёл?",
        "choices": [
            {"text": "1 г.",  "next": "brew_ryaska",
            "gives": {"flags": {"added_flowers": True, "flowers_g": 1},
                    "inventory": {"flowers": -1}}},
            {"text": "2 г.",  "next": "brew_ryaska",
            "gives": {"flags": {"added_flowers": True, "flowers_g": 2},
                    "inventory": {"flowers": -1}}},
            {"text": "3 г.",  "next": "brew_ryaska",
            "gives": {"flags": {"added_flowers": True, "flowers_g": 3},
                    "inventory": {"flowers": -1}}},
            {"text": "5 г.",  "next": "brew_ryaska",
            "gives": {"flags": {"added_flowers": True, "flowers_g": 5},
                    "inventory": {"flowers": -1}}},
            {"text": "10 г.", "next": "brew_ryaska",
            "gives": {"flags": {"added_flowers": True, "flowers_g": 10},
                    "inventory": {"flowers": -1}}},
            {"text": "Передумать", "next": "brew_ryaska"},
        ],
    },

    "post_acid": {
        "title": "Гнездо пиратов",
        "text": "Вы отмерили кислоту. Сколько влить в котёл?",
        "choices": [
            {"text": "1 мл.",  "next": "brew_ryaska",
            "gives": {"flags": {"added_acid": True, "acid_ml": 1},
                    "inventory": {"acid": -1}}},
            {"text": "3 мл.",  "next": "brew_ryaska",
            "gives": {"flags": {"added_acid": True, "acid_ml": 3},
                    "inventory": {"acid": -1}}},
            {"text": "5 мл.",  "next": "brew_ryaska",
            "gives": {"flags": {"added_acid": True, "acid_ml": 5},
                    "inventory": {"acid": -1}}},
            {"text": "10 мл.", "next": "brew_ryaska",
            "gives": {"flags": {"added_acid": True, "acid_ml": 10},
                    "inventory": {"acid": -1}}},
            {"text": "20 мл.", "next": "brew_ryaska",
            "gives": {"flags": {"added_acid": True, "acid_ml": 20},
                    "inventory": {"acid": -1}}},
            {"text": "Передумать", "next": "brew_ryaska"},
        ],
    },

    "post_spirt": {
        "title": "Гнездо пиратов",
        "text": "Вы откупорили бутылку 99%-го спирта. Сколько влить?",
        "choices": [
            {"text": "10 мл.",  "next": "brew_ryaska",
            "gives": {"flags": {"added_spirt": True, "spirt_ml": 10},
                    "inventory": {"spirt": -1}}},
            {"text": "20 мл.",  "next": "brew_ryaska",
            "gives": {"flags": {"added_spirt": True, "spirt_ml": 20},
                    "inventory": {"spirt": -1}}},
            {"text": "30 мл.",  "next": "brew_ryaska",
            "gives": {"flags": {"added_spirt": True, "spirt_ml": 30},
                    "inventory": {"spirt": -1}}},
            {"text": "50 мл.",  "next": "brew_ryaska",
            "gives": {"flags": {"added_spirt": True, "spirt_ml": 50},
                    "inventory": {"spirt": -1}}},
            {"text": "100 мл.", "next": "brew_ryaska",
            "gives": {"flags": {"added_spirt": True, "spirt_ml": 100},
                    "inventory": {"spirt": -1}}},
            {"text": "Передумать", "next": "brew_ryaska"},
        ],
    },

    "post_water": {
        "title": "Гнездо пиратов",
        "text": "Вы зачерпнули воду из ведра. Сколько влить в котёл?",
        "choices": [
            {"text": "5 мл.",   "next": "brew_ryaska",
            "gives": {"flags": {"added_water": True, "water_ml": 5},
                    "inventory": {"water": -1}}},
            {"text": "10 мл.",  "next": "brew_ryaska",
            "gives": {"flags": {"added_water": True, "water_ml": 10},
                    "inventory": {"water": -1}}},
            {"text": "20 мл.",  "next": "brew_ryaska",
            "gives": {"flags": {"added_water": True, "water_ml": 20},
                    "inventory": {"water": -1}}},
            {"text": "40 мл.",  "next": "brew_ryaska",
            "gives": {"flags": {"added_water": True, "water_ml": 40},
                    "inventory": {"water": -1}}},
            {"text": "50 мл.",  "next": "brew_ryaska",
            "gives": {"flags": {"added_water": True, "water_ml": 50},
                    "inventory": {"water": -1}}},
            {"text": "Передумать", "next": "brew_ryaska"},
        ],
    },

    "post_swarm_water": {
        "title": "Гнездо пиратов",
        "text": "Вы отлили из стакана болотной жижи. Сколько влить в котёл?",
        "choices": [
            {"text": "5 мл.",   "next": "brew_ryaska",
            "gives": {"flags": {"added_swarm_water": True, "swarm_water_ml": 5},
                    "inventory": {"swarm_water": -1}}},
            {"text": "10 мл.",  "next": "brew_ryaska",
            "gives": {"flags": {"added_swarm_water": True, "swarm_water_ml": 10},
                    "inventory": {"swarm_water": -1}}},
            {"text": "20 мл.",  "next": "brew_ryaska",
            "gives": {"flags": {"added_swarm_water": True, "swarm_water_ml": 20},
                    "inventory": {"swarm_water": -1}}},
            {"text": "40 мл.",  "next": "brew_ryaska",
            "gives": {"flags": {"added_swarm_water": True, "swarm_water_ml": 40},
                    "inventory": {"swarm_water": -1}}},
            {"text": "50 мл.",  "next": "brew_ryaska",
            "gives": {"flags": {"added_swarm_water": True, "swarm_water_ml": 50},
                    "inventory": {"swarm_water": -1}}},
            {"text": "Передумать", "next": "brew_ryaska"},
        ],
    },

    "cooking_book": {
        "title": "Гнездо пиратов",
        "text": (
            " Одолжив у фэянина галокнигу и вставив ее в аппарат для их чтения, вы открыли раздел \"Горячительное разных планет\", закладку Рахиш, где, к вашей радости, увидели рецепт пеленгской \"Болотной ряски\""
 
            "БОЛОТНАЯ РЯСКА"
            "================="
 
            "СОСТАВ:"
            
            "Болотная жижа,"
            "песок,"
            "водоросли,"
            "слабоконцентрированная угольная кислота,"
            "99% спирт,"
            "вода."
            
            "Одна порция коктейля равна 100 мл."
            
            "ПРИГОТОВЛЕНИЕ:"
            "..."
            "___________________ стр. 1826___________________"
            
            
            "Неплохо! Осталось найти эти компоненты."
        ),
        "choices": [
            {"text": "Занятся чем то еще", "next": "eat_room",
            "gives": {"flags": {"read_recipe": True}}},
        ],
    },

    "kino_room": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы в зале. На стене висит широчайший (в три раза больше вашего) стереовизор. На темно-зеленых диванах сидят три пеленга и смотрят \"ящик\", время от времени с хохотом комментируя происходящее на экране. На экране идет какой-то брутальный боевик про нападение пеленгских террористов на гаальское посольство планеты Элиния. Несчастные желтокожие гуманоиды зовут на помощь, а пеленги прижаривают их бластерными зарядами к стенам."
            "Сев на кресло вы почувствовали под вашим седалищем какой то придемет"
        ),
        "choices": [
            {"text": "Высказать положительное мнение о фильме", "next": "plus_kino", 
             "condition": {"flag_absent": "plus_kino"},
            "gives": {"flags": {"plus_kino": True}, "trust": {"Kacap": +10}}}, 
            {"text": "Высказать отрицательное мнение о фильме", "next": "minus_kino", 
            "condition": {"flag_absent": "minus_kino"},
            "gives": {"flags": {"minus_kino": True}, "trust": {"Kacap": -10}}}, 
            {"text": "Достать из под себя предмет", "next": "check_card",
            "condition": {"flag_absent": "check_card"},
            "gives": {"flags": {"check_card": True},    
            "inventory": {"card": 1}}},
            {"text": "Вернутся к лестнице", "next": "first_floor"}, 
        ],
    },

    "check_card": {
        "title": "Гнездо пиратов",
        "text": (
            "В поле тьме кино зала вы видите чью-то потерянную магнитную карту - судя по всему и по надписи на ней, от кладовки на улице."
        ),
        "choices": [
            {"text": "Выйти из зала", "next": "kino_room"},   
        ],
    },

    "plus_kino": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы подождали удобного случая и ловко втерлись в разговор пиратов о фильме. Похвалив режиссера за удачную съемку кино и погоготав с пеленгами, вы, конечно, заслужили уважение всей пиратской компании."
        ),
        "choices": [
            {"text": "Выйти из зала", "next": "first_floor"},   
        ],
    },

    "minus_kino": {
        "title": "Гнездо пиратов",
        "text": (
            " - Тут многовато насилия, - простодушно сказали вы, после чего услышали недовольные возгласы компании. "
            "- Пошел вон из зала! - крикнул один из пиратов. - Ты нам все веселье портишь, слюнтяй! "
            "Вы поняли, что сморозили глупость. Доверие смотревших, естественно, ухудшилось."
        ),
        "choices": [
            {"text": "Выйти из зала", "next": "first_floor"},   
        ],
    },

    "katsap_room_mid": {
        "title": "Гнездо пиратов",
            "text": (
            "Кацап сидел на кровати, развалившись на подушках, и вполглаза "
            "листал планшет. На экране мелькали схемы, столбцы цифр и "
            "знакомый логотип Дзухаллага. Услышав вас, он поднял голову — "
            "без раздражения, но и без особой радости. "
            "«Заходи. — Он отложил планшет экраном вниз. — Как сам? Освоился?» "
            "Вы кивнули, но ответить толком не успели — Кацап уже "
            "продолжил, будто сам с собой: «Тут один проект на днях "
            "закроем. Хлопот много, а толку — сами увидите.» "
            "Он потёр глаза и откинулся обратно на подушки. "
            "«Ты не стой над душой. Скажи, чего надо — или иди, "
            "дай отдохнуть.»"
        ),
        "choices": [
            {"text": "Предложить съездить в бар", "next": "no_go_katsap_bar",
            "condition": {"flag_absent": "no_go_katsap_bar"},
            "gives": {"flags": {"no_go_katsap_bar": True}}},
            {"text": "Выйти из комнаты босса", "next": "corridor"},
        ],
    },

    "other_room": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы взялись за ручку двери, но на секунду призадумались: \"Может, не стоит совать нос в чужие дела, пока Кацап мне не доверяет или, по крайней мере, не относится хорошо?\""
        ),
        "choices": [
            {"text": "Передумать", "next": "corridor"},

            {"text": "Зайти в комнату соседа",
            "next": "get_out",
            "condition": {"trust_below": {"name": "Kacap", "value": 60},
                        "flag_absent": "get_out"},
            "gives": {"trust": {"Kacap": -10}, "flags": {"get_out": True}}},

            {"text": "Зайти в комнату соседа",
            "next": "check_other_room",
            "condition": {"trust_at_least": {"name": "Kacap", "value": 60},
                        "flag_absent": "check_other_room"},
            "gives": {"flags": {"check_other_room": True}}},
        ],
    },

    "get_out": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы тихо приоткрыли дверь. "
            "- Чего надо? Проваливай! Надо сказать боссу, что всякие неудачники тут шляются... Ты еще здесь?! - и пират "
            " швырнул в вас ботинком. "
            "Вы захлопнули дверь и решили не ходить больше по другим комнатам, пока Кацап вам не доверяет."
        ),
        "choices": [
            {"text": "Покинуть комнату", "next": "corridor"},   
        ],
    },

    "check_other_room": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы в комнате своего соседа. Обставлена она так же, как и ваша. Прохладный ветерок гуляет по ней. Пока никто не видит, тут можно все обыскать."
        ),
        "choices": [
            {"text": "Обыскать кровать", "next": "check_other_bed"},
            {"text": "Обыскать тумбу", "next": "check_other_tumb",
            "condition": {"flag_absent": "checked_tumb"},
            "gives": {"flags": {"checked_tumb": True},
                    "money": 1000,
            "inventory": {"detonator": 1, "explosive": 1}}},
            {"text": "Обыскать стереовизор", "next": "check_other_tv"}, 
            {"text": "Обыскать шкаф", "next": "check_other_closet"},   
            {"text": "Покинуть комнату", "next": "corridor"},   
        ],
    },

    "check_other_bed": {
        "title": "Гнездо пиратов",
        "text": (
            "Кровать была ярко-зеленого цвета, с рисунками болотных лягушек. Что можно спрятать в кровати? Вот именно, что ничего. Рядом стоит тумба, может, от ее осмотра будет больше пользы?"
        ),
        "choices": [
            {"text": "Обыскать что-нибудь еще", "next": "check_other_room"}, 
        ],
    },

    "check_other_tv": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы подошли к висевшему на стене стереовизору и осмотрели его со всех сторон. Похоже, здесь ничего нет. Только передача \"Как потратить миллиард?\" шла на экране."
        ),
        "choices": [
            {"text": "Обыскать что-нибудь еще", "next": "check_other_room"}, 
        ],
    },

    "check_other_closet": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы осмотрели массивный болотно-зеленый шкаф, забитый полностью одинаковыми книгами. Однако как вы ни старались, ничего полезного в шкафу не нашли."
        ),
        "choices": [
            {"text": "Обыскать что-нибудь еще", "next": "check_other_room"}, 
        ],
    },

    "check_other_tumb": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы выдвинули первый ящик тумбы. На дне лежала 1000 рублей, какая-то книжка, а также два странных предмета: детонатор и взрывчатка. Недолго думая, вы сгребли все это себе в карман. "
            "Книжка оказалась личным дневником, защищенным магнито-сенсорным ключом владельца. "
            "Открыть замок грубой силой было просто невозможно, и вы с разочарованием положили дневник на место, "
            "а в отместку написали на нем неприличное слово. Зря, конечно, ведь на вас, как новенького, "
            "скорее всего и падет подозрение..."
        ),
        "choices": [
            {"text": "Обыскать что-нибудь еще", "next": "check_other_room"}, 
        ],
    },

    "katsap_room_first": {
        "title": "Гнездо пиратов",
        "text": (
            " Кацап валялся на кровати, пялясь в стереовизор, из которого доносились какие-то подозрительные звуки. "
            "- Ааа... - протянул Кацап. - Пришел уже. Тогда слушай сюда. Тут у нас один секретный проект к концу подходит, всего 2 дня осталось... "
            "Но к тебе это отношения не имеет. Твоя работа будет заключаться в том, чтобы \"замести следы\", ну... \"убрать\" лишних свидетелей после "
            "его завершения, понимаешь, о чем речь? Не зря ж тебя Черепом зовут. Но понадобишься ты только через 3 дня. За деньжата не беспокойся, "
            "будем делить все из братского принципа. "
            "Тут вы  поняли, что на космодром босс вас планирует привезти только после запуска корабля, а это вас никак не устраивало. "
            "Пеленг продолжал: "
            "- А пока осмотрись и отдохни, работенка-то у тебя пыльная, хе-хе, будет. И не суй свой нос не в свои дела, пока я тебе не доверяю... " "Вопросы есть?"
        ),
        "choices": KATSAP_QUESTION_CHOICES,             
    },

    "katsap_room_low": {
        "title": "Гнездо пиратов",
        "text": (
            "Кацап валялся на кровати, смотря стереовизор: на экране шел какой-то брутальный боевик про нападение пеленгских террористов на гаальское посольство планеты Элиния, где находится одна из крупнейших дипломатических баз. Несчастные желтокожие гуманоиды звали на помощь, а пеленги прижаривали их бластерными зарядами к стенам."
            "- Что надо?  - протянул Кацап. "
            "На правой верхней руке у него мигал всеми цветами спектра наручный пульт управления от фэянского телепортатора."
            "\"Видимо, полученный нечестным трудом\", - подумали вы.."
        ),
        "choices": [
            {
                "text": "Отдать карточку с пеленгессами",
                "next": "katsap_witsh_photo",
                "condition": {"inventory_has_all": ["photo"], "flag_absent": "set_get_photo"},
                "gives": {
                "inventory": {"photo": -1},
                "flags": {"set_get_photo": True},
                "trust": {"Kacap": 15}
                }
            },
            {
                "text": "Предложить съездить в бар",
                "next": "no_go_katsap_bar"
            },
            {
                "text": "Выйти из комнаты босса",
                "next": "corridor"
            }
        ]
    },

    "katsap_room_high": {
        "title": "Гнездо пиратов",
        "text": (
            "Кацап оторвался от стереовизора, махнул рукой в сторону кресла и убавил звук. "
            "\"- О, Череп! Заходи, заходи, чего в дверях-то стоишь?\" "
            "Пеленг выглядел на удивление бодрым — то ли выспался, то ли новости хорошие. "
            "\"- Слушай, я тут подумал... ты мужик правильный, сразу видно — свой. "
            "Не то что эти, — он кивнул куда-то в сторону двери. — "
            "Половина моих ребят только и умеют, что языками трепать, а как до дела — так в кусты. "
            "А ты вон — и с аэрокаром моим разобрался, и вообще...\" "
            "Он хитро прищурился. "
            "\"- Короче, Череп, есть у меня к тебе разговор. Но не сейчас, "
            "сначала пусть всё уляжется. А пока — отдыхай, осматривайся. "
            "Если что нужно будет — заходи, не стесняйся. Для тебя у меня всегда время найдётся.\""
        ),
        "choices": [
            {"text": "Что за секретный проект?",
            "next": "asc_about_secret",
            "condition": {"trust_at_least": {"name": "Kacap", "value": 80},
                        "flag_absent": "asked_secret_project"},
            "gives": {"flags": {"asked_secret_project": True}}},

            {
                "text": "Отдать карточку с пеленгессами",
                "next": "katsap_witsh_photo",
                "condition": {"inventory_has_all": ["photo"], "flag_absent": "set_get_photo"},
                "gives": {
                "inventory": {"photo": -1},
                "flags": {"set_get_photo": True},
                "trust": {"Kacap": 15}
                }
            },

            {"text": "Предложить съездить в бар", "next": "go_katsap_bar"},
            {"text": "Выйти из комнаты босса", "next": "corridor"},
        ],
    },

    "katsap_witsh_photo": {
        "title": "Гнездо пиратов",
        "text": (
            "Кацап взял фотографию, и его лицо расплылось в довольной ухмылке. "
            "«Ах ты ж… Где ты её откопал, Череп? Ладно, считай, что я твой должник»."
        ),
        "choices": [{"text": "Выйти из комнаты", "next": "corridor"}],
    },

    "asc_about_secret": {
        "title": "Гнездо пиратов",
        "text": (
            "Кацап оторвался от просмотра стереовизора. "
            "- А... да, забыл... Сам видишь, сколько дел. Поедем сейчас и будем там весь день. "
            "- Эмм. Куда поедем? - вы сделали вид, что ничего не знаете. "
            "- Мы поедем на космодром сегодня, ты там освоишься немного, поможешь вечерком заткнуть одного слишком уж болтливого субъекта. Правда, после того, как он и еще пара специалистов устранят последние неполадки корабля. Кстати, увидишь нашу гордость - лучший корабль пиратского флота. "
            "Кацап встал с кровати и, взяв бластер и некоторые другие вещи (в том числе и жучки), приказал следовать за ним."
        ),
        "choices": [
            {"text": "Следовать за Кацапом", "next": "go_cosmodrom"},
        ],
    },


    "katsap_room_empty": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы открыли дверь и увидели, что Кацап, похоже, куда-то телепортировался - неплохой повод, чтобы похозяйничать здесь!"
        ),
        "choices": [
            {"text": "Обыскать комнату", "next": "check_katsap_room"},
            {"text": "Выйти из комнаты босса", "next": "corridor"},
        ],
    },

    "check_katsap_room": {
        "title": "Гнездо пиратов",
        "text": (
            "Комната босса встретила вас тишиной. Пахло дешёвым пеленгским "
            "одеколоном и болотной тиной — видимо, Кацап так и не научился "
            "плотно закрывать флакон с любимым парфюмом. Плоский стереовизор "
            "на стене был выключен, кровать аккуратно заправлена, а на тумбочке "
            "лежала недоеденная лягушачья лапка в сахаре. Самого хозяина нигде "
            "не было — судя по тихому гудению телепортатора в углу, он куда-то "
            "смылся в спешке. Отличный момент, чтобы осмотреться."
        ),
        "choices": [
            {"text": "Обыскать тумбу", "next": "check_katsap_tumb"},
            {"text": "Обыскать стереовизор", "next": "check_katsap_tv",
            "condition": {"flag_absent": "check_katsap_tv"},
            "gives": {"flags": {"check_katsap_tv": True}, "money": 450}},
            {"text": "Обыскать шкаф", "next": "check_katsap_closet",
            "condition": {"flag_absent": "checked_katsap_closet"},
            "gives": {"flags": {"checked_katsap_closet": True}}},
            {"text": "Осмотреть телепортатор", "next": "check_katsap_teleport"},
            {"text": "Передумать и выйти из комнаты босса", "next": "corridor"},
        ],
    },

    "check_katsap_teleport": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы подошли к маленькому телепортатору, встроенному в пластиковый пол. Рядом на стене была панель управления, дружественно подмигивавшая вам то синими, то зелеными лампочками. Можно попробовать телепортироваться куда-нибудь, но, скорее всего, Кацап заметит, что вы трогали его телепортер."
        ),
        "choices": [
            {"text": "Подойти к панели управления", "next": "check_katsap_panel"},
            {"text": "Телепортироваться куда-нибудь", "next": "active_katsap_teleport"},
            {"text": "Отойти от телепортатора", "next": "check_katsap_room"},
        ],
    },

    "active_katsap_teleport": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы размяли пальцы и, проигнорировав предупреждение об опасности телепортации, решили попробовать перенестись куда-нибудь. Активировав сенсорную клавиатуру, вы осмотрели панель управления: "
 
            "FeiДжоуль - ПАНЕЛЬ УПРАВЛЕНИЯ - зарегистрированная копия (Амиолис) - лицензия до 31.12.9999 "
            "Последняя телепортация: Кацап (136.3,561.7,309.1)"
            "Введите команду: userProenix85_"
 
            "Хм, интересно. Куда бы телепортироваться? Или лучше не баловаться с телепортатором? Все-таки предупреждения не просто так пишут..."
        ),
        "choices": [
            {"text": "Телепортироваться по координатам 666.H,666.E,666.LL", "next": "teleport_666h"},
            {"text": "Отойти от телепортатора", "next": "check_katsap_room"},
        ],
    },

    "teleport_666h": {
        "title": "Гнездо пиратов",
        "text": (
            "Телепортатор слегка загудел, и вы исчезли из комнаты. Навсегда. Никто не знал, что вы появились прямо в центре ядра планеты Полуось и сгорели за считанные миллисекунды. Какой нелепый конец для известного пирата!"
    
            "Хм, интересно. Куда бы телепортироваться? Или лучше не баловаться с телепортатором? Все-таки предупреждения не просто так пишут..."
        ),
        "choices": [],
    },

    "check_katsap_panel": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы подошли к панели управления - она была сделана из титанового сплава и вмонтирована прямо в стену. На ней было много рядов кнопок для телепортации - от двора до этой комнаты. Чуть ниже была настройка ручной телепортации. Вы глянули на экран панели и поняли, что телепортироваться не будете: "
 
            "FeiДжоуль - ПАНЕЛЬ УПРАВЛЕНИЯ - зарегистрированная копия (Амиолис) - лицензия до 31.12.9999 "
            "Последняя телепортация: Кацап (192.28,5.8.309.1) "
            "Введите команду:_"
 
            "Иначе подлый компьютер запишет, что вы были здесь."
        ),
        "choices": [
            {"text": "Отойти от телепортатора", "next": "check_katsap_room"},
        ],
    },

    "check_katsap_closet": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы осмотрели массивный болотно-зеленый шкаф, забитый "
            "полностью одинаковыми книгами. Однако как вы ни обыскивали, "
            "так ничего в шкафу и не нашли."
        ),
        "choices": [
            {"text": "Вы вспомнили подсказку Кацапа, открыли первую книгу на 161-й странице и сказали пароль",
            "next": "katsap_closet_fail",
            "condition": {"flag_present": "asc_about_dom"}},
            {"text": "Посмотреть книги", "next": "check_katsap_books"},
            {"text": "Обыскать другие вещи", "next": "check_katsap_room"},
        ],
    },

    "katsap_closet_fail": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы сказали свой пароль и... ничего не произошло. Кацап поставил на шкаф другую фразу. Вы решили больше не пробовать набирать пароль до тех пор, пока не узнаете его у Кацапа, и вернулись к обыску других вещей."
        ),
        "choices": [
            {"text": "Вернуться к осмотру",
            "next": "check_katsap_room",
            "gives": {"flags": {"checked_katsap_closet": True}}},
        ],
    },

    "check_katsap_books": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы вытащили первую и сорок пятую книги. Абсолютно одинаковые, только тексты другие."
        ),
        "choices": [
            {"text": "Обыскать другие вещи", "next": "check_katsap_room"},
        ],
    },

    "check_katsap_tumb": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы выдвинули первый ящик тумбы и обомлели! Прямо на дне ящика тумбы лежала толстенная пачка денег в 10000 руб. Пока никто не видит, можно стащить эти деньжищи, но шанс, что босс заметит пропажу и вы провалите миссию - очень велик!"
        ),
        "choices": [
            {"text": "Взять 10000 рублей", "next": "get_10000",
            "condition": {"flag_absent": "took_katsap_money"},
            "gives": {"flags": {"took_katsap_money": True}}},
            {"text": "Обыскать другие вещи", "next": "check_katsap_room"},
        ],
    },

    "get_10000": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы спешно запихали 10 000 рублей себе за пазуху и по-тихому ушли..."
            "Вечером, когда вы лежали на кровати в своей комнате, дверь с грохотом открылась от удара ногой, и вошел хмурый Кацап с криобластером в руках и малоком сзади:"
            "- Надо же быть таким простаком, {player_name}, жадность фраера сгубила! - прокричал пеленг и, не дав вам опомниться, всадил заряд прямиком вам в голову."
            "Кто же мог предположить, что это была очередная ловушка, и в пачке был спрятан датчик слежения для проверки таких как вы... Но вас это уже не беспокоило..."
        ),
        "choices": [],
    },

    "check_katsap_tv": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы подошли к висевшему на стене стереовизору и осмотрели его со всех сторон. Похоже, здесь ничего нет. Стойте! Что это? Из-за стереовизора выглядывает уголок бумажки. Изрядно помучившись и покарябав панель, вы наконец вытащили ее. Не помешают вам 450 рублей, спрятанных за стереовизором!"
        ),
        "choices": [
            {"text": "Обыскать что-то еще", "next": "check_katsap_room"},
        ],
    },

    "no_go_katsap_bar": {
        "title": "Гнездо пиратов",
        "text": (
            " - Да ну... - протянул снова босс. - Не хочу, я пил уже сегодня. Тем более, не видишь, я важным делом занят. Стерек смотрю. Позже зайди, ладно? "
 
            "— Ладно, — сказали вы. — Позже зайду.\n"
        ),
        "choices": [
            {"text": "Выйти из комнаты босса", "next": "corridor"},
        ],
    },

    "go_katsap_bar": {
        "title": "Гнездо пиратов",
        "text": (
            "- А почему бы и нет? - повеселел пеленг. - Идем. Я тут один бар неподалеку знаю - \"ТЮРЕМОК\" называется."
            "Вы погрузили свои тела в мягкие сиденья и понеслись навстречу веселью. Пока вы летели, Кацап заговорил снова:"
            "- Ты все оплачиваешь."
            "- Для босса ничего не жалко! - бодрились вы, а сами принялись пересчитывать рубли. Итого у вас {money} рублей. \"Надеюсь, этого хватит\", - подумали вы."
            "Машина плавно летела в метре над мокрой дорогой, шел мелкий моросящий дождь, по бокам пролетали редкие аэрокары. А вы прочно запоминали дорогу. Через пятнадцать минут вы уже входили в небольшой серый дом с помигивающей неоновой вывеской. Кацап занял любимый столик, намекнув вам про выпивку."
        ),
        "choices": [
            {"text": "Осмотреть бар", "next": "katsap_bar"},
        ],
    },

    "katsap_bar": {
        "title": "Гнездо пиратов",
        "text": (
            "- Бар был маленьким и душным. Деревянные стены прямо-таки смеялись над современными полипластиками, под потолком висела самая обычная электрическая лампа, столики и барная стойка тоже были сделаны из дерева, и уже успели прилично засалиться. И что босс нашел в этом баре? Ответ на этот вопрос, похоже, знает только сам Кацап."
        ),
        "choices": [
            {"text": "К бармену", "next": "go_barman"},
            {"text": "К столику с Кацапом", "next": "go_katsap_table"},
            {"text": "Выйти из бара", "next": "exit_bar"},
        ],
    },

    "go_barman": {
        "title": "Гнездо пиратов",
        "text": (
            "Бармен-пеленг протирает двумя нижними руками стакан грязнейшей серой тряпкой. При этом чем больше он его трет, тем больше стакан покрывается грязью. Пеленг скучно смотрит на вас: "
            "- Ну, будем чего-нибудь заказывать?"
        ),
        "choices": [
            {"text": "Да, давай посмотрим, что у вас есть", "next": "bar_menu"},
            {"text": "Можешь рассказать о напитках?", "next": "asc_about_drink"},
            {"text": "Нет, ничего я не заказываю", "next": "katsap_bar"},
        ],
    },

    "asc_about_drink": {
        "title": "Гнездо пиратов",
        "text": (
            " - Да здесь и рассказывать нечего. Вот втыкилла, гуанава, пиво \"Махпельское темное\"... - пеленг показывал вам известные бутылки. - Да, твой посетитель - не малок?"
            "- Пеленг. "
            "- Никогда не давай ему малокского ядерного! На несколько дней отключится, если выпьет. "
            " - Спасибо, учту. "
            "- А теперь, может, купишь что-нибудь?" ""
        ),
        "choices": [
            {"text": "Да, давай посмотрим, что у вас есть", "next": "bar_menu"},
            {"text": "Нет, ничего не покупаю", "next": "katsap_bar"},
        ],
    },

    "bar_menu": {
        "title": "Гнездо пиратов",
        "text": (""
                "Бармен указал на ряды бутылок. Вы присмотрели четыре вроде бы подходящие:"
 
                "1) Пиво \"Махпельское темное (слабое спиртное)\""
                "2) Втыкилла (умеренное)"
                "3) Гуанава (очень сильное)"
                "4) Малокское ядерное (ядерное)" 
                
                "Что будем брать?"),
        "choices": [
            {"text": "Купить \"Махпельское темное\" (75 рублей)",
            "next": "get_dark_drink",
            "condition": {"flag_absent": "get_dark_drink", "money_at_least": 75},
            "gives": {"flags": {"get_dark_drink": True},
                    "money": -75,
                    "inventory": {"dark_drink": 1}}},

            {"text": "Купить втыкиллы (150 рублей)",
            "next": "get_vtekilla",
            "condition": {"flag_absent": "get_vtekilla", "money_at_least": 150},
            "gives": {"flags": {"get_vtekilla": True},
                    "money": -150,
                    "inventory": {"vtekilla": 1}}},

            {"text": "Купить гуанавы (55 рублей)",
            "next": "get_guanava",
            "condition": {"flag_absent": "get_guanava",  "money_at_least": 55},
            "gives": {"flags": {"get_guanava": True},
                    "money": -55,
                    "inventory": {"guanava": 1}}},

            {"text": "Купить малокского ядерного (2 рубля)",
            "next": "get_nucker_malok",
            "condition": {"flag_absent": "get_nucker_malok",  "money_at_least": 2},
            "gives": {"flags": {"get_nucker_malok": True},
                    "money": -2,
                    "inventory": {"nucker_malok": 1}}},

            {"text": "Передумать и ничего не покупать", "next": "katsap_bar"},
        ],
    },

    "go_katsap_table": {
        "title": "Гнездо пиратов",
        "text": (
            " При виде вас Кацап оживился. "
            "- Ну что, принес? - с надеждой в голосе проговорил он. - Если нет, поторопись, не буду же я тут вечно сидеть, хе-хе..."
        ),
        "choices": [
            {"text": "Да, вот стаканчик", "next": "katsap_drink_dark",
            "condition": {"inventory_has_all": ["dark_drink"]}, 
            "gives": {"inventory": {"dark_drink": -1}}},
            {"text": "Да, вот стаканчик", "next": "katsap_drink_vtekilla",
            "condition": {"inventory_has_all": ["vtekilla"]},   
            "gives": {"inventory": {"vtekilla": -1}}},
            {"text": "Да, вот стаканчик", "next": "katsap_drink_guanava",
            "condition": {"inventory_has_all": ["guanava"]},    
            "gives": {"inventory": {"guanava": -1}}},
            {"text": "Да, вот стаканчик", "next": "katsap_drink_nucker_malok",
            "condition": {"inventory_has_all": ["nucker_malok"]},
            "gives": {"inventory": {"nucker_malok": -1}}},
            {"text": "Сейчас, подожди минутку", "next": "katsap_bar"},
            {"text": "Едем домой, у меня нет денег", "next": "bar_no_money", "gives": {"trust": {"Kacap": -15}}},
        ],
    },

    "katsap_drink_dark": {
        "title": "Гнездо пиратов",
        "text": (
            "Кацап взял стакан. Вы стали ждать. Кацап немного поболтал стакан "
            "из стороны в сторону и отхлебнул немного, а затем полностью "
            "опустошил стакан с пивом \"Махпельское тёмное\"."
        ),
        "choices": [
            {"text": "Ждать", "next": "drink_dark_result"},
        ],
    },

    "drink_dark_result": {
        "title": "Гнездо пиратов",
        "text": (
            "- Ну, рассказывай, {player_name}, что-нибудь. Не будем же мы в тишине сидеть."
            "- Кажется этого старого пирата легим пивасиком не возьмешь - подумали вы про себя"
        ),
        "choices": [
            {"text": "Ждать", "next": "go_barman"},
        ],
    },

    "katsap_drink_vtekilla": {
        "title": "Гнездо пиратов",
        "text": (
            "Кацап взял стакан. Вы стали ждать. Кацап немного поболтал стакан "
            "из стороны в сторону и отхлебнул немного, а затем полностью "
            "опустошил стакан с втыкиллой."
        ),
        "choices": [
            {"text": "Ждать", "next": "vtekilla_result"},
        ],
    },

    "vtekilla_result": {
        "title": "Гнездо пиратов",
        "text": (
            " - {player_name},{player_name}... Расскажи что-нибудь... Я... ик, слушаю..."
        ),
        "choices": [
            {"text": "Ты мне что-нибудь расскажи", "next": "katsap_bad_request",
            "condition": {"flag_absent": "katsap_bad_request"},
            "gives": {"flags": {"katsap_bad_request": True}, "trust": {"Kacap": -5}}},
            {"text": "Давай поговорим о жизни", "next": "asc_about_live",
            "condition": {"flag_absent": "asc_about_live"},
            "gives": {"flags": {"asc_about_live": True}, "trust": {"Kacap": +5}}},
            {"text": "Как дела, Кацап?", "next": "asc_about_ship",
            "condition": {"flag_absent": "asc_about_ship"},
            "gives": {"flags": {"asc_about_ship": True}, "trust": {"Kacap": +1}}},
            {"text": " А что тебе рассказать?", "next": "katsap_bad_two_request",
            "condition": {"flag_absent": "katsap_bad_two_request"},
            "gives": {"flags": {"katsap_bad_two_request": True}, "trust": {"Kacap": -5}}},
        ],
    },

    "katsap_bad_request": {
        "title": "Гнездо пиратов",
        "text": (
            " - Ты меня в бар привел, ты и рассказывай, - коротко и понятно ответил Кацап."
        ),
        "choices": [
            {"text": "Давай о корабле поговорим", "next": "asc_about_ship",
            "condition": {"flag_absent": "asc_about_ship"},
            "gives": {"flags": {"asc_about_ship": True}, "trust": {"Kacap": -5}}},
            {"text": " Ну... давай о жизни поговорим", "next": "asc_about_live",
            "condition": {"flag_absent": "asc_about_live"},
            "gives": {"flags": {"asc_about_live": True}, "trust": {"Kacap": +5}}},
            {"text": "Ладно, что-то я устал от разговоров. Поехали", "next": "katsap_no_more_say"}, 
        ],
    },

    "katsap_bad_two_request": {
        "title": "Гнездо пиратов",
        "text": (
            " Пеленг с недоумением уставился на вас."
            "- Ты меня в бар... это... привел, а теперь... ну... тему для разговора... придумывать заставляешь?! Ладно... скажи лучше, ты поддерживаешь малоков... или нет?"
        ),
        
        "choices": [
                {"text": "Нет, терпеть их не могу!", "next": "hate_malock",
                "condition": {"flag_absent": "hate_malock"},
                "gives": {"flags": {"hate_malock": True}, "trust": {"Kacap": +7}}},
                {"text": " Конечно, прекрасная раса", "next": "like_malock",
                "condition": {"flag_absent": "like_malock"},
                "gives": {"flags": {"like_malock": True}, "trust": {"Kacap": -5}}},
        ],
    },

    "like_malock": {
        "title": "Гнездо пиратов",
        "text": (
            "  Лицо Кацапа исказилось в злобе. "
            "- А я нет!!! Терпеть не могу эти мешки с мускулами! Такие уж неповоротливые. Да ты видел дверь этого идиота Громиллы в... этом... особняке?! Проломана насквозь!!! Ладно, неважно. Вообще, ты какой организации большее предпочтение отдаешь?"
        ),
        "choices": [
            {"text": "Мне нравятся гаальские спецслужбы", "next": "like_gaal",
            "condition": {"flag_absent": "like_gaal"},
            "gives": {"flags": {"like_gaal": True}, "trust": {"Kacap": -13}}},
            {"text": " У меня нет любимой организации", "next": "no_like_any",
            "condition": {"flag_absent": "no_like_any"},
            "gives": {"flags": {"no_like_any": True}, "trust": {"Kacap": -3}}},
            {"text": "Обожаю Дзухаллаг!", "next": "like_duzlak",
            "condition": {"flag_absent": "like_duzlak"},
            "gives": {"flags": {"like_duzlak": True}, "trust": {"Kacap": +7}}},
            {"text": " I love Greenpeace!", "next": "greenpeace",
            "condition": {"flag_absent": "greenpeace"},
            "gives": {"flags": {"greenpeace": True}, "trust": {"Kacap": -13}}},
        ],
    },

    "hate_malock": {
        "title": "Гнездо пиратов",
        "text": (
            " Кацап улыбнулся. "
            "- Вот и правильно! Я тоже. Такие неуклюжие... Самые настоящие мешки... Ты видел дверь этого идиота Громиллы в... этом... особняке?! Проломана насквозь. Хе-хе. Да, а вообще, ты какой организации большее предпочтение отдаешь?"
        ),
        "choices": [
            {"text": "Мне нравятся гаальские спецслужбы", "next": "like_gaal",
            "condition": {"flag_absent": "like_gaal"},
            "gives": {"flags": {"like_gaal": True}, "trust": {"Kacap": -13}}},
            {"text": " У меня нет любимой организации", "next": "no_like_any",
            "condition": {"flag_absent": "no_like_any"},
            "gives": {"flags": {"no_like_any": True}, "trust": {"Kacap": -3}}},
            {"text": "Обожаю Дзухаллаг!", "next": "like_duzlak",
            "condition": {"flag_absent": "like_duzlak"},
            "gives": {"flags": {"like_duzlak": True}, "trust": {"Kacap": +7}}},
            {"text": " I love Greenpeace!", "next": "greenpeace",
            "condition": {"flag_absent": "greenpeace"},
            "gives": {"flags": {"greenpeace": True}, "trust": {"Kacap": -13}}},
        ],
    },

    "like_gaal": {
        "title": "Гнездо пиратов",
        "text": (
            " - Ааааааа! Ненавижу их! Заткнись ты! Кстати, ты на Дзухаллаг работать не хочешь?!"
        ),
         "choices": [
            {"text": "Конечно, хочу!?", "next": "katsap_no_more_say",
            "condition": {"flag_absent": "asc_about_dzuch"},
            "gives": {"flags": {"asc_about_dzuch": True}, "trust": {"Kacap": +3}}},  
            {"text": "Нет, не хочу", "next": "exit_asc_katsap",
            "condition": {"flag_absent": "exit_asc_katsap"},
            "gives": {"flags": {"exit_asc_katsap": True}, "trust": {"Kacap": -8}}},  
        ],
    },

    "exit_asc_katsap": {
        "title": "Гнездо пиратов",
        "text": (
            "— Нет, не хочу, — твёрдо сказали вы.\n\n"
            "Кацап на секунду замер, словно пытаясь осмыслить услышанное. "
            "Потом лицо его расплылось в пьяной ухмылке.\n"
            "— Ага… ну да… все так говорят, — протянул он, явно не расслышав "
            "или не пожелав расслышать. — Скромничаешь, братан! Уважаю. "
            "Настоящий пират сначала поломается, а потом всё равно согласится. "
            "Хе-хе…\n\n"
            "Он хлопнул вас по плечу так, что вы едва не присели, и поднял "
            "очередной стакан.\n"
            "— Так что давай, за знакомство! А потом я тебя, это… "
            "отвезу куда надо. На месте всё покажу. Там такое увидишь — "
            "закачаешься!\n\n"
            "Спорить с пьяным пеленгом, который уже всё решил за вас, "
            "было бесполезно."
        ),
        "choices": [{"text": "Чокнуться с Кацапом", "next": "katsap_no_more_say"}],
    },

    "no_like_any": {
        "title": "Гнездо пиратов",
        "text": (
            "- Ну и зря... Кстати, ты на Дзухаллаг работать не хочешь?.."
        ),
            "choices": [
            {"text": " Конечно, хочу!?", "next": "katsap_no_more_say",
            "condition": {"flag_absent": "asc_about_dzuch"},
            "gives": {"flags": {"asc_about_dzuch": True}, "trust": {"Kacap": +3}}},  
            {"text": "Нет, не хочу", "next": "exit_asc_katsap",
            "condition": {"flag_absent": "exit_asc_katsap"},
            "gives": {"flags": {"exit_asc_katsap": True}, "trust": {"Kacap": -8}}},  
        ],
    },

    "like_duzlak": {
        "title": "Гнездо пиратов",
        "text": (
            " - О! Вот это дело! Я... тож... е... Кстати... ты на Дзухаллаг... работать не хочешь?"
        ),
            "choices": [
            {"text": " Конечно, хочу!?", "next": "katsap_no_more_say",
            "condition": {"flag_absent": "asc_about_dzuch"},
            "gives": {"flags": {"asc_about_dzuch": True}, "trust": {"Kacap": +3}}},  
            {"text": "Нет, не хочу", "next": "exit_asc_katsap",
            "condition": {"flag_absent": "exit_asc_katsap"},
            "gives": {"flags": {"exit_asc_katsap": True}, "trust": {"Kacap": -8}}},  
        ],
    },

    "greenpeace": {
        "title": "Гнездо пиратов",
        "text": (
            "- ЧТО?! Ненавижу... Гринпис!.. "
            "- Но ведь они спасают природу, а вы природу любите. "
            "- Я... ненавижу и все. Кстати, ты на Дзухаллаг работать не хочешь? "
            " Странный пеленг."
        ),
            "choices": [
            {"text": " Конечно, хочу!?", "next": "katsap_no_more_say",
            "condition": {"flag_absent": "asc_about_dzuch"},
            "gives": {"flags": {"asc_about_dzuch": True}, "trust": {"Kacap": +3}}},  
            {"text": "Нет, не хочу", "next": "exit_asc_katsap",
            "condition": {"flag_absent": "exit_asc_katsap"},
            "gives": {"flags": {"exit_asc_katsap": True}, "trust": {"Kacap": -8}}},  
        ],
    },

    "asc_about_ship": {
        "title": "Гнездо пиратов",
        "text": (
            "  Кацап приуныл. "
            " - Жду тут запуска корабля треклятого... никакой личной жизни с ним нету... вот..."
        ),
        "choices": [
            {"text": "О! Хорошая тема! Давай о жизни поговорим", "next": "asc_about_live",
            "condition": {"flag_absent": "asc_about_live"},                
            "gives": {"flags": {"asc_about_live": True},
                    "trust": {"Kacap": +5}}},
            {"text": " А что за корабль?", "next": "no_sey_about_ship",
            "condition": {"flag_absent": "no_sey_about_ship"},
            "gives": {"flags": {"no_sey_about_ship": True},
                    "trust": {"Kacap": -5}}},
            {"text": "Ладно, хватит о кораблях. Давай о другом", "next": "why_this_bar"},  
        ],
    },

    "no_sey_about_ship": {
        "title": "Гнездо пиратов",
        "text": (
            " Кацап нисколько не удивился вашему вопросу. "
            "- Такая машина боевая... ясно? Ай, давай о другом. Достала... меня... эта тема. "
 
            "Похоже, вы на верной волне, только вряд ли Кацапу понравится слушать дальше ваши вопросы."
        ),
        "choices": [
            {"text": "Хорошо, давай о жизни поговорим?", "next": "asc_about_live",
            "condition": {"flag_absent": "asc_about_live"},
            "gives": {"flags": {"asc_about_live": True}, "trust": {"Kacap": +5}}},
            {"text": " Корабль совмещает в себе завод и боевую машину?", "next": "asc_about_drednout",
            "condition": {"flag_absent": "asc_about_drednout"},
            "gives": {"flags": {"asc_about_drednout": True}, "trust": {"Kacap": -7}}},
        ],
    },

    "asc_about_live": {
        "title": "Гнездо пиратов",
        "text": (
            " - А че? Давай... Вот у меня... невеста есть... такая прекрасная, как все четыре... луны Рахиша... Такая самка... красивая, как комочек болотной... это... тины... я вот... после этой... этого... запуска планирую... свадьбу на родном болоте... устроить, в общем... пусть будут все... надо б друзей на Рахиш собрать... а то так давно родного дома не видели..."
        ),
        "choices": [
            {"text": "  Расскажи, как ты стал пиратом?", "next": "asc_about_pirat_style",
            "condition": {"flag_absent": "asc_about_pirat_style"},
            "gives": {"flags": {"asc_about_pirat_style": True}, "trust": {"Kacap": +3}}},
            {"text": "А какой он, твой родной дом? Расскажи о своей семье?", "next": "asc_about_family",
            "condition": {"flag_absent": "asc_about_family"},
            "gives": {"flags": {"asc_about_family": True}, "trust": {"Kacap": +3}}},
        ],
    },

    "asc_about_family": {
        "title": "Гнездо пиратов",
        "text": (
            "- Да... в доме моем ничего интересного... вот... на планете Рахиш жил в грязной прогнившей хижине на болоте Цаввацах... это близ... этой.... как там ее... Марринианского горного хребта... самого высокого на... этой... как там ее... планете... Мой отец к четвертому периоду моего возраста... сидел в тюрьме... за контрабанду и пиратство в гаальских системах... я его уже почти не помню... слышал от друзей... что он... умер там недавно... ужас... а еще говорят... что гаальцы самые добрые, милосердные и... да какая разница! Хуже малоков!.. ладно, ну их к Махпелле... о чем я говорил?.. да, вспомнил... мать моя... забыл ее уже... а сестрица полетела пиратствовать в пеленгско-гаальской системе... вот. Я помню, встретил ее в той системе, а она: \"Плати за проезд, не то разнесу в клочья!\" - потом узнала меня и скидку за проезд процентов на пять сделала... вместо трех тысяч пришлось платить две восемьсот пятьдесят... вот нахалка! Я как разберусь с запуском... так саму ее разведу на бабки... - Кацап улыбнулся."
        ),
        "choices": [
            {"text": "С каким запуском ты разберешься?", "next": "asc_about_ship",
            "condition": {"flag_absent": "family_ship_shown"},
            "gives": {"flags": {"family_ship_shown": True}, "trust": {"Kacap": -5}}},
        ],
    },

    "asc_about_pirat_style": {
        "title": "Гнездо пиратов",
        "text": (
            "  - Ай... - поник Кацап, - помню, как решил стать пиратом... мой дом был - гнилое болото, сейчас у меня... на Рахише есть красивый особнячок... там мы поженимся с моей луноликой красавицей... А пиратом стал из-за родни... помню, когда был еще маленьким пеленгошей, любил подбирать разных рахишианских жучков и червяков, но не есть их, а внимательно рассматривать... интересно они выглядели... но моя родня... такого подхода не оценила и отругала, даже побила за то, что... как фэянин, говорили..."
        ),
        "choices": [
        {"text": "И?", "next": "asc_about_pirat_style_more",
        "condition": {"flag_absent": "pirat_style_more_shown"},  
        "gives": {"flags": {"pirat_style_more_shown": True},
        "trust": {"Kacap": +1}}},
    ]
    },

    "asc_about_pirat_style_more": {
        "title": "Гнездо пиратов",
        "text": (
            "  - ...сунули мне в руку пачку сигарет \"Пеленгейтор\" и говорят... Иди... и в тайне от нас... покуривай немного... ну... и я их... собственно, продал какому-то пеленгоше с меня ростом... Меня побили за то, что захотел стать честным предпринимателем... как они сказали... мерзкие, вонючие людишки с развратной планеты Земля... на Землю-то я летал, как стал пиратом... вот... там и вправду все такое! милиция, контрабанда запрещена, наркоту с трудом сбыл... ужас! сплошной разврат пеленгской молодежи... Ай, ладно... тебе это... наверное, не интересно... Лучше скажи, не хочешь ли на Дзухаллаг работать?"
        ),
        "choices": [
            {"text": " Конечно, хочу!?", "next": "katsap_no_more_say",
            "condition": {"flag_absent": "asc_about_dzuch"},
            "gives": {"flags": {"asc_about_dzuch": True}, "trust": {"Kacap": +3}}},  
            {"text": "Нет, не хочу", "next": "exit_asc_katsap",
            "condition": {"flag_absent": "exit_asc_katsap"},
            "gives": {"flags": {"exit_asc_katsap": True}, "trust": {"Kacap": -8}}},  
        ],
    },

    "katsap_no_more_say": {
        "title": "Гнездо пиратов",
        "text": (
            " - Отлично... Я как приедем, свожу в космопорт... Привезу..."
            "Пеленг окончательно потерял ориентацию в пространстве и смотрел куда-то влево вверх."
        ),
        "choices": [
            {"text": " Эй, все в порядке?", "next": "wtf_with_katsap",
            "condition": {"flag_absent": "wtf_with_katsap"},
            "gives": {"flags": {"wtf_with_katsap": True}, "trust": {"Kacap": -9}}},  
            {"text": "  Что с тобой?", "next": "wtf_with_katsap_two",
            "condition": {"flag_absent": "wtf_with_katsap_two"},
            "gives": {"flags": {"wtf_with_katsap_two": True}, "trust": {"Kacap": +1}}},  
            {"text": "Ты дурак что ли? Что кривляешься?", "next": "wtf_with_katsap_durak",
            "condition": {"flag_absent": "wtf_with_katsap_durak"},
            "gives": {"flags": {"wtf_with_katsap_durak": True}, "trust": {"Kacap": -20}}},  
        ],
    },

    "wtf_with_katsap_durak": {
        "title": "Гнездо пиратов",
        "text": (
            " Кацап буквально взбесился."
            " - Да я тебе!!!"
            "Пеленг хотел напасть на вас, но по непонятным причинам остановился. Видимо, алкоголь сильно подействовал на него."
        ),
        "choices": [
            {"text": "Давай вернемся к разговору?", "next": "why_this_bar"},    
        ],
    },

    "wtf_with_katsap_two": {
        "title": "Гнездо пиратов",
        "text": (
            "  - Ниччегоо.... Ты это... не обращай внимания... вот... - ответил вам Кацап, ничего не понимая."
        ),
        "choices": [
            {"text": "Давай вернемся к разговору?", "next": "why_this_bar"},    
        ],
    },

    "wtf_with_katsap": {
        "title": "Гнездо пиратов",
        "text": (
            " Кацап буквально взбесился. "
            "- Я тебе не Эй!.. Еще одна такая фраза, и я кому-то набью морду..."
            "Пеленг уже хотел наброситься на вас, но по непонятным причинам остановился. Видимо, алкоголь сильно подействовал на него."
        ),
        "choices": [
            {"text": "Давай вернемся к разговору?", "next": "why_this_bar"},    
        ],
    },

    "why_this_bar": {
        "title": "Гнездо пиратов",
        "text": (
            "Кацап словно очнулся ото сна. "
            "- А... да... что тебе интересно узнать? Я... отвечу... если смогу..."
        ),
        "choices": [
            { "text": "Что ты нашел в этом баре?", "next": "why_this_bar_two" },
            {
                "text": "Где находится космодром?",
                "next": "where_cosmodrome",
                "condition": { "flag_absent": "where_cosmodrome" },
                "gives": { "flags": { "where_cosmodrome": True } }
            }
        ]
    },

    "where_cosmodrome": {
        "title": "Гнездо пиратов",
        "text": (
            "- Какой космодром?"
            "Вы начали объяснять, но пеленг ничего не понимал. Эх, зря вы задали этот вопрос. Однако вы все же выудили некоторую информацию и узнали, что космодром спрятан на первом материке этой луны, где находитесь вы, неподалеку от нескольких синхрофазерных станций и орошающих установок, в дельте реки Нейле. Осталось сообщить Русману, куда он должен прилететь после завершения задания, и дело в шляпе! Кацапу же вскоре стало плохо, и он попросил вас отвезти его домой. Пеленг встал из-за стола (при этом едва не свалившись на пол), и вы вышли с ним из бара."
        ),
        "choices": [
            {"text": "Дать вести машину Кацапу", "next": "katsap_drive"}, 
            {"text": "Сесть за руль самому ", "next": "self_drive",
            "condition": {"flag_absent": "self_drive"},
            "gives": {"flags": {"self_drive": True}, "trust": {"Kacap": +5}}},    
        ],
    },

    "why_this_bar_two": {
        "title": "Гнездо пиратов",
        "text": (
            "- Я... ну... мне этот бар... напоминает... точнее, в нем... ну... очень уютно, в общем... нравится мне этот бар и все! "
            "Больше ничего от пеленга вы добиться не смогли. Эх, зря вы задали этот вопрос. Кацапу же, судя по его виду, стало плохо, и он попросил вас отвезти его домой. Пеленг встал из-за стола (при этом едва не свалившись на пол), и вы вышли с ним из бара."
        ),
        "choices": [
            {"text": "Дать вести машину Кацапу", "next": "katsap_drive"}, 
            {"text": "Сесть за руль самому ", "next": "self_drive",
            "condition": {"flag_absent": "self_drive"},
            "gives": {"flags": {"self_drive": True}, "trust": {"Kacap": +5}}},    
        ],
    },

    "self_drive": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы сели за руль, посадив пеленга на заднее сидение. "
            "- Ааа.... ну да, рейнджер... веди аэрокар домой... "
            "Вы завели двигатели и направились по спутниковой навигации в особняк. Приехав, вы упали на кровать и заснули, как убитый."
        ),
        "choices": [
            {"text": "Проснуться ", "next": "my_room"},    
        ],
    },

    "katsap_drive": {
        "title": "Гнездо пиратов",
        "text": (
            "Глупо было давать управление аэрокаром пьяному пеленгу. Уже на второй минуте езды ему показалось, что фонарные столбы впереди готовятся перебегать дорогу, он резко вывернул руль и свернул куда-то не туда... "
            "Машина покатилась с обрыва, перевернулась и взорвалась, погребя вас под своими останками."
        ),
        "choices": [],
    },

    "asc_about_drednout": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы решили не отступать и продолжали терзать Кацапа вопросами. "
            "- Да нет, что ты! - крикнул он на весь бар. - Это... там корабль обычный... про \"завод\" и \"машину\" слышу впервые... кто тебе сказал?"
        ),
        "choices": [
            {"text": "Агент планеты Окошки Виста - Русман", "next": "sey_about_rusman",
            "condition": {"flag_absent": "sey_about_rusman"},
            "gives": {"flags": {"sey_about_rusman": True}, "trust": {"Kacap": -7}}},
            {"text": "Никто, вот стаканчик", "next": "go_barman"},
        ],
    },

    "sey_about_rusman": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы уже прикусили себе язык за эти слова, но, к счастью, Кацап был так пьян, что ничего не понял. "
            "- А... - весело сказал он, - ну передай ему... это... привет от меня... хе-хе... ненавижу этого агента..."
        ),
        "choices": [
           {"text": "Давай вернемся к нашему разговору", "next": "why_this_bar"}, 
        ],
    },

    "katsap_drink_guanava": {
        "title": "Гнездо пиратов",
        "text": (
            "Кацап взял стакан. Вы стали ждать. Кацап немного поболтал стакан "
            "из стороны в сторону и отхлебнул немного, а затем полностью "
            "опустошил стакан с гуанавой."
        ),
        "choices": [
            {"text": "Ждать", "next": "vtekilla_result"},
        ],
    },

    "katsap_drink_nucker_malok": {
        "title": "Гнездо пиратов",
        "text": (
            "Кацап взял стакан. Вы стали ждать. Кацап немного поболтал стакан "
            "из стороны в сторону и отхлебнул немного, а затем полностью "
            "опустошил стакан с малокским ядерным."
        ),
        "choices": [
            {"text": "Ждать", "next": "kill_katsap_nucker_malok"},
        ],
    },

    "kill_katsap_nucker_malok": {
        "title": "Гнездо пиратов",
        "text": (
            "Похоже, малокское ядерное и было самым натуральным малокским ядерным. Малоки никогда не врут с названиями. "
            "Опустошив стакан, Кацап упал без сознания. Как вы ни пытались ему помочь, ничего не получалось. "
            "В панике вы вызвали скорую помощь. Несколько медиков в белых халатах подхватили босса за все руки и "
            "перенесли в машину, поругав вас за неправильно выбранный напиток. "
            " - Он будет лежать в госпитале две местных недели - это ровно 24 дня. А оплачивать лечение теперь будете вы."
            "Вы тяжело вздохнули и сели в аэрокар скорой помощи. Однако потом, сославшись на неотложные дела и войну с доминаторами, заплатили врачам за лечение почти все свои деньги и покинули больницу. Дойдя до космопорта, вы спустили оставшиеся деньги в ближайшем баре, добрались до своего корабля и покинули эту луну, вернувшись на планету Полуось..."
        ),
        "choices": [],
    },

    "get_dark_drink": {
        "title": "Гнездо пиратов",
        "text": (
            "Бармен взял деньги и протянул вам банку «Махпельского тёмного». "
            "Это была обычная банка из самораспадающегося безвредного пластика."
        ),
        "choices": [
            {"text": "Принести пойло Кацапу", "next": "go_katsap_table",
            "gives": {"flags": {"get_dark_drink": True}}},
        ],
    },

    "get_vtekilla": {
        "title": "Гнездо пиратов",
        "text": (
            "Бармен взял деньги и протянул вам бутылку втыкиллы. "
            "Это была обычная банка из самораспадающегося безвредного пластика."
        ),
        "choices": [
            {"text": "Принести пойло Кацапу", "next": "go_katsap_table",
            "gives": {"flags": {"get_vtekilla": True}}},
        ],
    },

    "get_guanava": {
        "title": "Гнездо пиратов",
        "text": (
            "Бармен взял деньги и протянул вам бутылку гуанавы. "
            "Это была обычная банка из самораспадающегося безвредного пластика."
        ),
        "choices": [
            {"text": "Принести пойло Кацапу", "next": "go_katsap_table",
            "gives": {"flags": {"get_guanava": True}}},
        ],
    },

    "get_nucker_malok": {
        "title": "Гнездо пиратов",
        "text": (
            "Бармен взял деньги и протянул вам банку малокского ядерного. "
            "Это была обычная банка из самораспадающегося безвредного пластика."
        ),
        "choices": [
            {"text": "Принести пойло Кацапу", "next": "go_katsap_table",
            "gives": {"flags": {"get_nucker_malok": True}}},
        ],
    },

    "bar_no_money": {
        "title": "Гнездо пиратов",
        "text": (
            "Кацап сначала удивился, а затем пришел в ярость. "
            "- Ну ты и бомж! Самый бедный из бомжей! Убирайся! Едем домой! Только время зря потерял! "
            "Вы залезли на заднее сиденье аэрокара и ждали прибытия в особняк, что очень скоро случилось. "
            "Кацап вышел первым и закрыл перед вами дверь в ярости."
        ),
        "choices": [
            {"text": "Войти", "next": "first_floor"},
        ],
    },

    "exit_bar": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы направились к выходу. Как же это глупо! Привести босса в бар, чтобы узнать интересующую информацию, и выйти из бара! Нет, выходить сейчас вы не будете."
        ),
        "choices": [
            {"text": "Вернуться к бармену", "next": "go_barman"},
            {"text": "Вернуться к Кацапу", "next": "go_katsap_table"},
        ],
    },


    "asc_about_ship_fatal": {
        "title": "Гнездо пиратов",
        "text": (
            "- О каком корабле? - переполошился пеленг. - Я про корабль вообще не упоминал! А-А-А!!! Шпион проклятый, сам себя выдал!!! Держи его, вали!!! "
 
            "Набежали пираты и вместе с Кацапом принялись вас лупить. Катаясь по полу, вы кричали, что оговорились, что хотели спросить про его тачку-корабль... в общем, несли чушь, пытаясь успокоить Кацапа. К сожалению, ваш организм не вынес получасовые побои, и когда пираты оставили вас в покое, оттащив в вашу комнату, вы потеряли сознание. Навсегда."
        ),
        "choices": []
    },

    "asc_about_work": {
        "title": "Гнездо пиратов",
        "text": (
            " - Какая тебе разница? Я ж сказал, не суй нос в чужие дела!"
        ),
        "choices": [{"text": "Покинуть комнату", "next": "corridor"}],
    },
    
    "asc_about_dom": {
        "title": "Гнездо пиратов",
        "text": (
            " - Дом стандартной пеленгской планировки. Столовая, зал и кухня на первом, комнаты на втором этаже. Все. Рядом с домом красивое болотце и родниковая речка. Кстати, я тебе секрет со шкафом один скажу. Возьми в шкафу самую первую сверху галокнигу \"Приключения капитана Полоскина\", открой ее на 161-й странице. Все понял?"
        ),
        "choices": [{"text": "Покинуть комнату", "next": "corridor"}],
    },

    "asc_about_work_more": {
        "title": "Гнездо пиратов",
        "text": (
            "  - Хм... а память-то у тебя короткая... Хотя для твоей работы это плюс - меньше помнишь, лучше спишь, хе-хе-хе! - Кацап посмеялся своему афоризму. - В общем, слушай еще раз: твоя работа будет заключаться в том, чтобы \"замести следы\", ну... \"убрать\" лишних свидетелей после завершения проекта, понимаешь, о чем речь? Не зря ж тебя Черепом зовут... За деньжата не беспокойся, будем делить все из братского принципа."
        ),
        "choices": [{"text": "Покинуть комнату", "next": "corridor"}],
    },

    "my_room": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы находитесь в просторной комнате зеленоватых тонов. Приятный ветерок дует вам в лицо и развевает зеленые шторы. У правой стены находится мягкая кровать, рядом с ней тумба. Напротив окна - массивный зеленый шкаф. Слева расположился плоский компьютер последней модели, с него вам можно будет связаться с Русманом."
    
        ),
        "choices": [
            {"text": "Лечь на кровать", "next": "get_125_rub",
            "condition": {"flag_absent": "got_125_rub"},
            "gives": {"flags": {"got_125_rub": True}, "money": 125}},
            {"text": "Работать с компьютером", "next": "computer_work"},
            {"text": "Осмотреть шкаф", "next": "see_closet"},
            {"text": "Выйти в коридор", "next": "corridor"},
        ],
    },

    "get_125_rub": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы легли на кровать и услышали, как что-то хрустнуло под вами. Вскочив с кровати, вы увидели забытые кем-то 125 рублей, которые легко сливались с зеленью одеяла. Долго рублям лежать не пришлось, так как находились они уже в вашем кармане."
        ),
        "choices": [
             {"text": "Далее", "next": "bed"},
        ]
    },

    "see_closet": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы находитесь возле массивного книжного шкафа. Шкаф был сделан из редкого на этой планете рахишского зеленого дерева и полностью забит зачем-то одинаковыми темно-красными книгами \"Приключения капитана Полоскина\"."
            "\"Книги? Пеленгам?\" - удивились вы."
        ),
        "choices": [
            {"text": "Почитать книги", "next": "read_books"},
            {"text": "Отойти от шкафа", "next": "my_room"},
        ]
    },

    "read_books": {
        "title": "Гнездо пиратов",
        "text": (
            "Все книги на полке выглядели одинаково — как близнецы. "
            "Тёмно-красные корешки, золотое тиснение, ни одной зацепки. "
            "Вы задумались: с какой начать? "
            "С первой, что слева? С той, что посередине? Или, может, с последней? "
            "В голове почему-то всплыли слова Кацапа про какую-то книгу на 161-й странице... "
            "Хотя, если он вам ничего такого не говорил, придётся выбирать наугад."
        ),
        "choices": [
            {"text": "Вытащить самую первую книгу \"Приключения капитана Полоскина\"",
                "next": "true_book",
                "condition": {"flag_present": "asc_about_dom",
                            "flag_absent": "get_photo"},
                "gives": {"flags": {"get_photo": True}, "inventory": {"photo": 1}}},
            {"text": "Вытащить книгу из середины шкафа \"Приключения капитана Полоскина\"",
            "next": "false_book"},
            {"text": "Вытащить последнюю книгу \"Приключения капитана Полоскина\"",
            "next": "false_book"},
        ],
    },

    "true_book": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы вытащили самую первую сверху книгу — как и говорил Кацап. "
            "Открыли на 161-й странице — и правда, там, отступив три строчки, "
            "красуется надпись: «Запеленговал металлоразведчик». "
            "Вы уже собрались поставить книгу на место, как вдруг из неё вылетел листок. "
            "Голографическая фотография: Кацап в обществе пеленгесс-красоток. "
            "Вы забрали её себе — вдруг пригодится..."
        ),
        "choices": [
            {"text":  "Поставить книгу на место", "next": "see_closet"},
        ]
    },

    "false_book": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы вытащили наугад первую попавшуюся книгу. Это была какая-то приключенческая книга о пиратах, но написана она была так безвкусно, что вы тут же решили поставить ее на место и больше никогда не брать в руки."
        ),
        "choices": [
            {"text":  "Поставить книгу на место", "next": "see_closet"},
        ]
    },

    "computer_work": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы сидите прямо перед компьютером последней модели, на котором запущена система \"Macrohard Nondows Twista\" а на главном экране красуется откусанная груша. Продравшись сквозь первые пятнадцать багов, вы наконец приступили к работе."
        ),
        "choices": [
            {"text": "Связаться с Русманом", "next": "call_rusman", "gives": {"trust": {"Kacap": -5}}},
            {"text": "Посидеть в ЧебурНете", "next": "open_cheburnet"},
            {"text": "Выключить компьютер", "next": "my_room"},
        ]
    },

    "call_rusman": {
        "title": "Гнездо пиратов",
        "text": (
            "На экране возник виртуальный образ Русмана: взлохмаченные волосы, неясный взгляд, небритое лицо. Видимо, все это надо для маскировки. "
            "Не знай вы Русмана, подумали бы, что это бомж. "
        ),
        "choices": [
            {"text": "Очень важная информация, Русман! Я знаю, где пеленгский космодром с кораблем", "next": "say_about_cosmodrome",
            "condition": {"flag_present": "where_cosmodrome"},
            "gives": {"flags": {"where_cosmodrome_get": True}}},
            {"text": "Повтори задание", "next": "repid_job"},
            {"text": "Как завоевать доверие Кацапа?", "next": "repid_trust_katsap"},
            {"text": "Все отлично, я связался для проверки связи", "next": "my_room"},
        ]
    },

    "say_about_cosmodrome": {
        "title": "Гнездо пиратов",
        "text": (
            " Русман аж подпрыгнул на месте от такого неожиданного известия:"
            "- И где же??? Колись, {player_name}! Чем точнее расскажешь, тем выше шанс найти тебя после завершения задания. Сначала скажи, на каком материке находится космодром?"
        ),
        "choices": [
            {"text": "На первом материке, это тот, где я сейчас нахожусь", "next": "first_materick"},
            {"text": "На втором материке, он как раз необитаем, если не считать складов ядерных боеприпасов планеты Полуось", "next": "second_materick"},
            {"text": "На северном полюсе этой луны, где обитают морские бугрики и снежные слизни", "next": "three_materick"},
        ]
    },

    "need_object": {
        "title": "Гнездо пиратов",
        "text": (
            " - Отлично, {player_name}, в таком случае, мы запросто вытащим тебя оттуда. Возле космодрома были какие-нибудь признаки цивилизации?"
        ),
      "choices": [
            {"text": "Я знаю, что возле космодрома были какие-то наблюдательные вышки ",
            "next": "only_dots",
            "gives": {"flags": {"cosmo_intel_ok": True, "cosmo_intel_bad": False}}},
            {"text": "Я знаю, что возле космодрома были склады ядерных ракет планеты Полуось",
            "next": "nucker_rokets",
            "gives": {"flags": {"cosmo_intel_bad": True}}},
            {"text": "Я знаю, что возле космодрома были военные объекты планеты Полуось",
            "next": "war_objects",
            "gives": {"flags": {"cosmo_intel_bad": True}}},
            {"text": "Никаких признаков цивилизации возле космодрома нет",
            "next": "no_objects",
            "gives": {"flags": {"cosmo_intel_bad": True}}},
        ]
    },

    "no_objects": {
        "title": "Гнездо пиратов",
        "text": (
            "  - Понятно, - протянул Русман, - что-нибудь еще?"
        ),
        "choices": [
            {"text": "Нет, больше ничего не припоминаю",
            "next": "need_more_info_cosmo"},
        ]
    },

    "only_dots": {
        "title": "Гнездо пиратов",
        "text": (
            " - Учтем! - коротко ответил Русман. - Спасибо за информацию, {player_name}"
        ),
        "choices": [
            {"text": "Рассказать еще детали",
            "next": "need_more_info_cosmo",
            "gives": {"flags": {"cosmo_intel_ok": True}}}, 
        ]
    },

    "nucker_rokets": {
        "title": "Гнездо пиратов",
        "text": (
            " - Вот блин! - ругнулся Русман. - А еще эти чиновники выступали за глобальное ядерно-ионное разоружение. Смех, да и только!"
        ),
        "choices": [
            {"text": "Я знаю, что возле космодрома были какие-то наблюдательные вышки", "next": "need_more_info_cosmo"},
        ]
    },

    "war_objects": {
        "title": "Гнездо пиратов",
        "text": (
            " - Вот блин! - ругнулся Русман. - А еще эти чиновники выступали за пацифизм. Смех, да и только!"
        ),
        "choices": [
            {"text": "Я знаю, что возле космодрома были какие-то наблюдательные вышки", "next": "need_more_info_cosmo"},
        ]
    },

    "need_more_info_cosmo": {
        "title": "Гнездо пиратов",
        "text": (
            " - Рейнджер, попытайся разузнать о космодроме побольше, ладно? Надеюсь, мы легко найдем тебя, но все же командование требует информацию, а я, как видишь, еще и не брался."
        ),
        "choices": [
            {"text": "Постараюсь разузнать что-нибудь еще", "next": "call_rusman"},
        ]
    },
    
    "first_materick": {
        "title": "Гнездо пиратов",
        "text": (
            "  Русман удивился:"
            " Но ведь тут и крупный город Агро-Сити, и земледельческие поля, и радары, да мало ли чего еще. Странно. Надеюсь, ты прав. Теперь скажи, где он уже на этом континенте находится? Ну, там, в горах или еще где-то?"
        ),
         "choices": [
            {"text": "Космодром находится рядом с крупнейшей рекой этой луны — Нейле, в ее дельте",
            "next": "need_object",
            "gives": {"flags": {"cosmo_intel_ok": True, "cosmo_intel_bad": False}}},
            {"text": "Кацап говорил... под Великой Лунной Равниной",
            "next": "need_object",
            "gives": {"flags": {"cosmo_intel_bad": True}}},
            {"text": "Я не знаю особенностей географического положения космодрома",
            "next": "need_object",
            "gives": {"flags": {"cosmo_intel_bad": True}}},
        ]
    },

    "second_materick": {
        "title": "Гнездо пиратов",
        "text": (
            "- Хм... - призадумался Русман, - вполне возможно. Тем более что на второй материк нога человека не ступала со времен колонизации этой луны. Теперь скажи, где он уже на этом континенте находится? Ну, там, в горах или еще где-то?"
        ),
        "choices": [
            {"text": "Космодром находится рядом с крупнейшей рекой этой луны - Нейле, в ее дельте",
            "next": "need_object",
            "gives": {"flags": {"cosmo_intel_bad": True}}},
            {"text": "Кацап говорил, что космодром находится под одной из оранжевых равнин, а точнее, под Великой Лунной Равниной",
            "next": "need_object",
            "gives": {"flags": {"cosmo_intel_bad": True}}},
            {"text": "Я не знаю особенностей географического положения космодрома",
            "next": "need_object",
            "gives": {"flags": {"cosmo_intel_bad": True}}},
        ]
    },

    "three_materick": {
        "title": "Гнездо пиратов",
        "text": (
            "- Что?! - взревел Русман. - Да наш флаер рухнет камнем на землю, как только 60-е широты пересечем! Ты, наверное, ошибся. Попробуй вспомнить получше."
        ),
        "choices": [
            {"text": "Я ошибся, на первом континенте", "next": "first_materick",
            "gives": {"flags": {"cosmo_intel_bad": True}}},
            {"text": "Если честно, космодром на втором континенте", "next": "second_materick",
            "gives": {"flags": {"cosmo_intel_bad": True}}},
            {"text": "Да нет! Я точно помню, что на полюсе", "next": "need_object",
            "gives": {"flags": {"cosmo_intel_bad": True}}},
        ]
    },

    "repid_job": {
        "title": "Гнездо пиратов",
        "text": (
            " - Тебе нужно сорвать запуск корабля. Ты должен вести себя как настоящий пират и расположить к себе Кацапа, потому что только он знает точное местонахождение секретного космодрома. Когда узнаешь, где космодром, срочно сообщай мне об этом! В противном случае мы тебя не найдем. Если Кацап будет доверять тебе, то обязательно захочет похвастаться новейшей боевой машиной и отвезет тебя на космодром. Там ты проберешься к крейсеру, незаметно установишь на нем пару бомб и сразу свалишь оттуда.."
        ),
        "choices": [
            {"text": "Проснуться", "next": "call_rusman"},
        ]
    },

    "repid_trust_katsap": {
        "title": "Гнездо пиратов",
        "text": (
            "Кацап, самолично ограбивший несколько сотен торговцев и отсидевший почти во всех"
            " тюрягах нашей Галактики, уважает настоящих пиратов, их привычки и законы. "
            "Он с радостью заведет знакомство с таким же как он, поэтому мы тебя и позвали, {player_name}. "
            "Осталось только доказать Кацапу, что ты такой же отпетый негодяй, хе-хе, уж постарайся! "
    
            "По данным личного биографа Кацапа - гаальца Нааклю Ко - мы также узнали, "
            "что он, как и большинство пеленгов - большой любитель спиртного. "
            "Напоив Кацапа до нужной кондиции, можно выудить из него много полезной информации. "
            "Больше всего он любит рахишианскую \"Болотную ряску\". "
            "По межгалактическому договору ее запрещено продавать в барах, "
            "поэтому найди где-нибудь рецепт ряски и приготовь сам. "
            "Этот пеленг мало что смыслит в приготовлении ряски, но вот оценить ее "
            "вкус может не хуже автодегустатора. И, поверь, он будет обожать тебя "
            "до конца своих дней, если ты сможешь уважить его настоящей \"Ряской\"! "
        ),
        "choices": [
            {"text": "Проснуться", "next": "call_rusman"},
        ]
    },

    "open_cheburnet": {
        "title": "Гнездо пиратов",
        "text": (
            "\"Укажите адрес\", - поприветствовала вас система. Что бы такого набрать?"
        ),
        "choices": [
            {"text": "gns://bombinhome.maloc/", "next": "bomb_url"},
            {"text": "gns://music.peleng/", "next": "music_url"},
            {"text": "gns://riaskaportal.peleng/", "next": "rias_url"},
            {"text": "gns://pelengessa.peleng/", "next": "peleng_url",
            "condition": {"flag_absent": "peleng"},
            "gives": {"trust": {"Kacap": +7}, "flags": {"peleng": True}}},
            {"text": "Выключить ЧебурНет", "next": "my_room"},
        ]
    },

    "bomb_url": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы быстро ввели адрес, и галактическая сеть выдала вам бордовую страницу с неудобочитаемым красным текстом. Никакого намека на современную пространственную графику, имитаторы запахов и объемных звуков. Малокская страница. "
 
            "Сектор Гурт, система Тарон, планета Рамгатру, сервер С-5-Б. Адрес: gns://bombinhome.maloc/createbomb.gnp"
 
            "Как сделать сверхсупермощную бомбу у себя дома"
            "Для создания бомбы и полного уничтожения жалких войск противников нужно всего три вещи: таймер, детонатор и взрывчатка. Собирай все вместе и взрывай вражеские бараки с заводами. За великую малокскую расу!"
 
            "Бамбахчик. Эксперт по взрывчатым веществам."
 
            "Ниже следовало подробное описание всего нехитрого процесса создания бомбы. Вы попытались запомнить все до мелочей."
        ),
        "choices": [
            {"text": "Скопировать все на диск", "next": "copy_info"},
            {"text": "Закрыть страницу", "next": "open_cheburnet"},
        ]
    },

    "music_url": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы быстро продиктовали компьютеру необходимый адрес, и вскоре галактическая сеть выдала вам виртуальную комнату с "
            "несколькими пеленгами-андроидами. Каждый пеленг держит в руках традиционный музыкальный инструмент. Нужно настроить их "
            "на определенную игру. "
 
            "Сектор Хиша, система Пхедок, планета Рахиш, сервер М-2-Ц. Адрес: gns://music.peleng/sound.wrpa "
 
            " !!! ВНИМАНИЕ !!! "
            "В связи со скорой профилактикой сервера некоторые композиции нельзя прослушивать более раза. "
            "Учтите это, слушатели. "
 
            "Какой тон зададим музыкантам?"
    
            "Ниже следовало подробное описание всего нехитрого процесса создания бомбы. Вы попытались запомнить все до мелочей."
        ),
        "choices": [
            {"text": "Традиционную пеленгскую музыку", "next": "classic_track",  "condition": {"flag_absent": "classic_track"}, "gives": {"flags": {"classic_track": True}}},
            {"text": "Блатную пеленгскую музыку", "next": "pirat_track",
            "condition": {"flag_absent": "pirat_track"},
            "gives": {"flags": {"pirat_track": True}, "trust": {"Kacap": +10}}},

            {"text": "Тяжелый рок", "next": "hard_track",
            "condition": {"flag_absent": "hard_track"},
            "gives": {"flags": {"hard_track": True}, "trust": {"Kacap": -8}}},
            {"text": "Посмотреть что-нибудь другое", "next": "open_cheburnet"},
        ]
    },

    "classic_track": {
        "title": "Гнездо пиратов",
        "text": (
            " Заиграла мелодия струн гитары и кваканья рахишианских лягушек. Вы недолюбливали классическую пеленгскую музыку, и Кацап, скорее всего, тоже. Когда до него донеслась эта мелодия, его отношение не изменилось нисколько."
        ),
        "choices": [
            {"text": "Закончить слушать музыку", "next": "computer_work"},
        ]
    },

    "pirat_track": {
        "title": "Гнездо пиратов",
        "text": (
            " Заиграл современный пеленгский жабсон, который вы могли слышать на большинстве пиратских баз. Кваканье рагобамских жаб, струны гитары и новомодные звуковые спецэффекты сделали свое дело - доверие Кацапа поднялось, когда до него донеслась эта мелодия."
        ),
        "choices": [
           {"text": "Закончить слушать музыку", "next": "computer_work"},     
        ]
    },

    "hard_track": {
        "title": "Гнездо пиратов",
        "text": (
            " Заиграла настолько тяжелая музыка, что завибрировало огнеустойчивое стекло. Пеленги не натурально, а скорее комично играли на своих традиционных инструментах, что вызвало у вас приступ хохота... который мгновенно потонул в рое громких звуков."
        ),
        "choices": [
            {"text": "Закончить слушать музыку", "next": "computer_work"},     
        ]
    },

    "rias_url": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы быстро ввели необходимый адрес, и вскоре галактическая сеть выдала вам красивую трехмерную страницу пеленгской хижины пятых-шестых веков. Для большего эффекта вы надели шлем виртуальной реальности, и атмосфера древности окутала вас. Мягкий огонь в полукруглом камине, подвешенные к потолку связки сушеных лягушек, скрученный в трубочку свиток на столе. "
 
            "Сектор Хиша, система Пхедок, планета Рахиш, сервер Р-35-Р. Адрес: gns://riaskaportal.peleng/home.wrp"
 
            "Высветилось и погасло у вас перед глазами."
        ),
        "choices": [
            {"text": "Скопировать все на диск", "next": "copy_info"},    
            {"text": "Развернуть свиток", "next": "open_scroll"},     
            {"text": "Выйти из виртуального пространства", "next": "computer_work"},     
            {"text": "Выйти из хижины", "next": "exit_bungalo"},      
        ]
    },

    "open_scroll": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы развернули древний свиток, который был исписан мелким пеленгским почерком: "
 
            "БОЛОТНАЯ РЯСКА"
            "Этот горячительный напиток был впервые получен доисторическими пеленгами более 6 тысяч лет назад. "
            "При смешении некоторых болотных и речных компонентов, а также добавлении сока рахишианского стволового дерева, "
            "в котором находится 99%-й спирт, был получен первый горячительный коктейль на планете Рахиш. С тех пор прошло много "
            "тысяч лет, но даже сейчас, в тридцать третьем веке, пеленги передают этот рецепт из поколения в поколение. "
 
            "СОСТАВ "
            "Болотная жижа,"
            "песок,"
            "водоросли,"
            "слабоконцентрированная угольная кислота,"
            "99% спирт,"
            "вода. "
 
            "Одна порция коктейля равна 100 мл. "
 
            "ПРИГОТОВЛЕНИЕ"
            "Смешайте вышеуказанные компоненты в пропорциях: на одну пятую стакана воды долить одну пятую стакана болотной жижи и "
            "полстакана спирта. Добавьте 5 мл слабой угольной кислоты, чтобы придать напитку кисловато-жгучий вкус. "
            "Досыпьте столько же (около 2 г от общей массы напитка) песка и добавьте 3 г водорослей, затем помешивайте "
            "10 минут на слабом огне и разливайте по бокалам. Ваши пеленгские гости будут рады такому угощению! "
 
            "Внимание! Никогда не добавляйте уже налитый компонент второй раз! Иначе напиток прокиснет и будет непригоден для употребления."
 
            "Что ж, это точно вам пригодится, если вы будете готовить ряску. По крайней мере, список компонентов уже есть."
        ),
        "choices": [
            {"text": "Скопировать информацию со свитка", "next": "copy_info"},    
            {"text": "Взять свиток с собой", "next": "get_scroll"},          
            {"text": "Покинуть виртуальное пространство", "next": "open_cheburnet"},      
        ]
    },

    "get_scroll": {
        "title": "Гнездо пиратов",
        "text": (
             "\"Объект не имеет материальной формы, - проинформировала вас Nondows Twista. - Возможность реализации виртуального предмета в материальный мир предусмотрена только гаальской технологией. Посетите наиболее развитую гаальскую планету для получения объекта\". Как только вы кликнули пальцем кнопку \"ОК\", Nondows Twista выдала критическую ошибку и вырубила компьютер. Придется открывать все заново."
        ),
        "choices": [    
            {"text": "Заняться другими делами", "next": "my_room"},     
            {"text": "Снова включить компьютер", "next": "open_cheburnet"},      
        ]
    },

    "exit_bungalo": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы вышли из хижины и вдохнули виртуальный свежий ночной воздух. Небо украшали десятки незнакомых созвездий,"
            " скорее всего, пятых веков планеты Рахиш. Вы подошли к болоту и поболтали рукой в воде. Интересно, "
            "насколько реалистично сделано ощущение воды у пеленгов? С реализмом никаких проблем не было. Кто-кто, а пеленги в воде "
            "толк знают. "
            "Неожиданно вы почувствовали, что кто-то задел вашу руку плавником. Вы быстро отдернули ее и направились к хижине. Раздался плеск воды, и вы увидели в свете местной луны страшное чудовище. Чудище издало хрип и двинулось к вам. Нужно что-то делать."
        ),
        "choices": [
            {"text": "Взломать систему", "next": "hack_system"},    
            {"text": "Покинуть виртуальное пространство", "next": "open_cheburnet"},           
        ]
    },

    "hack_system": {
        "title": "Гнездо пиратов",
        "text": (
            "Вспомнив свои хакерские способности, вы открыли сенсорную консоль и попытались взломать систему, чтобы убрать мерзкого болотного монстра. Но когда вы ввели команду /kill KaKoI-to_MonSTer_Iz_BolotA, система Nondows Twista выдала критическую ошибку и вырубила компьютер. Придется открывать все заново."
        ),
        "choices": [
            {"text": "Снова включить компьютер", "next": "open_cheburnet"},
            {"text": "Заняться другими делами", "next": "my_room"},
        ]
    },

    "copy_info": {
        "title": "Гнездо пиратов",
        "text": (
            "Когда вы уже навели палец на сенсорном экране на кнопку сохранения информации, Nondows Twista выдала критическую ошибку и вырубила компьютер. Придется открывать все заново."
        ),
        "choices": [
            {"text": "Снова включить компьютер", "next": "open_cheburnet"},
            {"text": "Заняться другими делами", "next": "my_room"},
        ]
    },

    "peleng_url": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы быстро продиктовали компьютеру адрес, и вскоре галактическая сеть выдала вам трехмерную комнату с виртуальными красотками-пеленгессами. "
 
            "Сектор Хиша, система Пхедок, планета Рахиш, сервер П-1-С. Адрес: gns://pelengessa.peleng/main.wrp"
 
            "СУПЕР МЕГА САЙТ С ПЕЛЕНГСКИМИ КРАСАВИЦАМИ"
 
            "!!! ВНИМАНИЕ !!!"
            "В связи с большой загруженностью сервера зайти на него можно не более раза. "
            "Учтите это, дорогие посетители. "
 
            "Вы принялись бродить по виртуальной комнате, пожирая глазами пеленгесс, как вдруг в дальнем конце зала материализовался... Кацап."
            "\"- {player_name} А ты что здесь делаешь?\""
            "\"- Пеленгессами наслаждаюсь\" - ответили вы. "
            "Кацап похвалил вас, но тут же попросил выйти с сайта в связи с объявлением. По тону его голоса вы поняли, что относится к вам он теперь гораздо лучше. \"Скопирую-ка я девчонок себе...\" - хитро подумали вы."
        ),
        "choices": [
            {"text": "Покинуть виртуальное пространство", "next": "open_cheburnet"},      
            {"text": "Скопировать все на диск", "next": "copy_info"},
        ]
    },

    "bed": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы лежите на мягкой зеленой кровати. Прямо на стене висит широкий стереовизор. Мягкая подушка, на которой лежит ваша голова, приглашает вас заснуть крепким сном. Но делать этого сейчас нельзя."
        ),
        "choices": [
            {"text": "Уснуть", "next": "go_sleep"}, 
            {"text": "Смотреть стереовизор", "next": "see_tv"},
            {"text": "Обдумать план побега", "next": "escape"},
            {"text": "Встать с кровати", "next": "my_room"},
        ]
    },

    "go_sleep": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы улеглись поудобнее, чтобы вздремнуть минуток 10. Десять минут превратились в 10 часов. "
            "Вы проснулись глубокой ночью и за неимением желания бродить по дому в темноте, легли снова. "
            "Так прошел один важный день, за который вы могли сделать многое, чтобы получить доступ на корабль."
        ),
        "choices": [
        
            {"text": "Проснуться",
            "next": "bed",
            "condition": {"days_at_least": 1},
            "gives": {"days": -1}},                    
        ]
    },

    "see_tv": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы сказали стереовизору: \"Включись!\" - и широкий плазменный экран со стереоэффектом загорелся. "
            "- Выберите канал, - ответил вам стереовизор. "
            "Вы назвали первый пришедший в голову канал и начали смотреть передачу. На экране шел малокский фильм о войнах будущего. "
            "По сюжету, в 3355 на приграничные малокские системы напала Конфедерация Отсталых Рас - союз гаальцев, фэян, и людей. Пеленги же "
            "сражались под собственным флагом. \"Этакое возвращение в век открытия первых разумных рас\", - подумали вы."
        ),
        "choices": [
            {"text": "Лечь спать", "next": "go_sleep"},
            {"text": "Вернуться к делам", "next": "my_room"},
        ]
    },

    "escape": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы развалились на мягкой кровати и стали думать, что отсюда пора смываться. В конце концов, вы ведь не предполагали, что возникнут"
            " такие сложности во время выполнения такого простого, на первый взгляд, задания."
            "\"Осталось обдумать план побега, - решили вы. - Что я могу сделать, чтобы выбраться отсюда?\""
            "Спустя полчаса вы набросали в голове целых три плана побега, каждый из которых мог абсолютно непредсказуемо закончиться для вас."
            "Вы все никак не могли сделать выбор между ними:"
 
            "ПЛАН А"
            "Состоит в том, чтобы быстро и незаметно покинуть особняк через окно, спустившись по веревке (или, если веревки не будет, "
            "по веревке из постельного белья), и добраться до гаража. Оттуда угнать любую аэромашину и гнать в космопорт на запредельной скорости. "
 
            "ПЛАН B"
            "Состоит в том, чтобы быстро и незаметно покинуть особняк ночью, просто угнав личный аэрокар Кацапа, и достигнуть космопорта до рассвета"
            "пока не проснулись пеленги."
 
            "ПЛАН C"
            "Был очень осторожным и продуманным. Сначала нужно было добыть днем все необходимое - веревку для спуска со второго этажа, "
            "затем серной кислоты, чтобы на всякий случай вывести из строя сенсорную дверь в комнату Кацапа и сломать цифровой замок гаража... "
            "кроме того, нужен был электронный инвентор, способный взломать код любой машины, и еще пара вещиц. "
            "Когда все будет собрано и спрятано под кроватью, нужно дождаться времени, когда все будут спать, заблокировать дверь в свою "
            "комнату и тихо спуститься через окно. Сломав замок, направиться к аэрокару и, подобрав код, уехать из особняка."
        ),
        "choices": [
            {"text": "ПЛАН А", "next": "plan_a", "condition": {"flag_absent": "get_plan_a"}, "gives": {"flags": {"get_plan_a": True}}},
            {"text": "ПЛАН B", "next": "plan_b", "condition": {"flag_absent": "get_plan_b"}, "gives": {"flags": {"get_plan_b": True}}},
            {"text": "ПЛАН C", "next": "plan_c", "condition": {"flag_absent": "get_plan_c"}, "gives": {"flags": {"get_plan_c": True}}},
            {"text": "Отбросить эти мысли и вернуться к выполнению задания", "next": "no_escape"},
        ]
    },

    "plan_a": {
        "title": "Гнездо пиратов",
        "text": (
            "\"План А - самое то!\" - решили вы и довольно развалились на широкой кровати. Весь день вы занимались тем же, чем и до принятия "
            "плана, однако забыли поискать в доме прочную плазмонитевую веревку. Когда план А вступил в действие, вы обнаружили "
            "сей неприятный факт. Пришлось связать непрочную веревку из подручных постельных материалов. "
            " Однако вы не нашли ни одного пригодного места, чтобы прочно привязать ее. Пришлось привязать к титановой ножке кровати. "
            "Проверив прочность, вы выбросили веревку в окно и аккуратно спустились. Вернее, хотели аккуратно спуститься, "
            "однако веревка треснула в районе первого этажа, и вы ушиблись, упав на сырую землю. "
            "Вторая часть плана прошла не лучше первой - гараж оказался закрытым на цифро-сенсорный код, и вам пришлось идти всю дорогу до космопорта пешком. Лишь к рассвету вы увидели очертания большого города... Спустя два часа вы были уже в космопорте и предъявляли необходимые для отлета документы, а спустя час садились на блестящие пластиковые плиты космопорта планеты Полуось..."
        ),
        "choices": []
    },

    "plan_b": {
        "title": "Гнездо пиратов",
        "text": (
            "\"План В - стопроцентная гарантия!\" - решили вы и довольно развалились на широкой кровати. Весь день вы занимались тем же, чем и до принятия плана, даже не думая о плане, однако когда пришло время его выполнения, все пошло наперекосяк. В гараж ночью без специальной карты доступа попасть не удалось. Зато удалось вызвать подозрение вашим отсутствием ночью в своей комнате, когда туда заглянул один из пиратов Кацапа. "
            "Всю ночь вы пытались попасть в гараж, пока из ближайших кустов вам в лицо не прыгнула какая-то тварь местного происхождения и не укусила больно за нос. Вы стряхнули зверюгу, взвыли от боли и побежали в дом. Всю ночь вам снилось, что вас кусают самые разные твари. И только днем вы окончательно проснулись. Зеркало показало, что ваш нос после укуса стал таким же зеленым как и морда Кацапа. К счастью, аптечка помогла, и нос снова стал самим собой. После сеанса лечения вы устало упали на кровать."
        ),
        "choices": [
            {"text": "Далее", "next": "bed", "gives": {"trust": {"Kacap": -12}}},     
        ]
    },

    "plan_c": {
        "title": "Гнездо пиратов",
        "text": (
            "\"План С - лучший выбор!\" - решили вы и довольно развалились на широкой кровати. Весь день вы занимались тем же, чем и "
            "до принятия плана, однако не забыли поискать в доме прочную плазмонитевую веревку, взять в гараже колбу с серной кислотой, "
            "купить на последние деньги у пеленга-коммерсанта электронный инвентор и найти еще целую горсть нужных (и не очень) вещей. "
            "Когда план С вступил в действие, вы начали выполнять продуманные действия прямо-таки со швейцарской точностью. "
            "Сначала вы направились в комнату Кацапа и тихо ее осмотрели: на глаза попался телепортатор. Спустя мгновение телепортатор зашипел, "
            " и у вас появился соблазн полить кислотой самого Кацапа... что вы незамедлительно и сделали. Затем, выйдя из комнаты, вы вывели из "
            " строя сенсорный замок, а также остальные, чтобы не обделить таким \"подарком\" других пиратов. Убедившись, что вам больше ничего "
            "не угрожает, вы вернулись в свою комнату и, заблокировав дверь изнутри, вылезли по веревке в окно. Сделав в широкой двери "
            "гаража сквозную дыру оставшейся кислотой, вы взломали систему безопасности одного из аэрокаров и вынесли дверь с ходу. "
            "Спустя два часа вы были уже в космопорте и предъявляли необходимые для отлета документы, а спустя час садились на блестящие пластиковые плиты космопорта планеты Полуось..."
        ),
        "choices": []
    },

    "no_escape": {
        "title": "Гнездо пиратов",
        "text": (
            " - Рейнджеры не ищут легких путей! - сказали вы вслух самому себе. - В конце концов, любые трудности можно преодолеть любой ценой. "
            "А может, и нельзя. Ну, это уже не важно... "
            "Вы бесцельно уставились взглядом на встроенную в потолок плазмолампу."
        ),
        "choices": [
            {"text": "Далее", "next": "bed"},
        ]
    },

    "go_cosmodrom": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы последовали за боссом в гараж. А спустя минуту заняли место в том самом аэрокаре люкс-класса, на котором прибыли сюда. Аэрокар приподнялся, и в метре над землей помчался в сторону далеких равнин. Машина летела несколько часов, прежде чем остановилась у небольшого десантного флаера, куда вы и пересели. Один из подручных Кацапа повел аэрокар назад в особняк. Флаер поднялся в воздух. Спустя час флаер сел на берегу широкой реки — точнее, в её дельте. Возле небольшого бункера кабина открылась. В бункере была всего одна лифтовая кабинка, спускавшаяся куда-то под землю. Босс зашел в нее, а вы последовали за ним."
        ),
        "choices": [
            {"text": "Зайти в лифт", "next": "enter_lift"},
        ],
    },

    "enter_lift": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы вошли в небольшой лифт. Щелкнула кнопка, и лифт тронулся. Было слышно, как работает какой-то механизм наверху. Неожиданно быстро кабинка вздрогнула и остановилась. Вы вышли и очутились в длинном, ярко освещенном коридоре. Босс указал вам на ваш кабинет со словами:"
            " - Скоро я зайду за тобой, никуда отсюда не уходи."
            "И удалился."
        ),
        "choices": [
            {"text": " Осмотреться", "next": "see_base"},
        ],
    },

    "see_base": {
        "title": "Гнездо пиратов",
        "text": (
            "Широкий длинный коридор был освещен яркими плазменными лампами. Фэянские и гаальские ученые ходили туда-сюда. Сразу было видно, что радости им работа доставляет мало. Автоматическая дверь перед вами вела в ваш кабинет, сзади был лифт, на котором вы сюда спустились. Двойная металлическая дверь лабораторий располагалась рядом с массивной дверью и двумя малоками-охранниками на посту."
        ),
        "choices": [
            {"text": "К охраняемой двери", "next": "base_doors"},
            {"text": "В лабораторию", "next": "base_laboratory"},
            {"text": "В свой кабинет", "next": "base_my_room"},
            {"text": "В чужой кабинет", "next": "base_other_room"},
        ],
    },

    "base_doors": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы подошли к охраняемой двери - массивной структуре из отполированного до зеркального "
            "блеска металла. Бдительные малоки, стоявшие на посту, были вооружены тяжелыми бластерами. "
            "Вы даже заметили в стенах, потолке и полу круглые углубления, которые служили, скорее "
            "всего, для сокрытия турелей.\n"
            "- Чего надо? - прогрохотал малок. - Убирайся! Без ключа никого не пускаем!\n"
            "Что ж, значит, придется где-то раздобыть этот магнитный ключ."
        ),
        "choices": [
            {"text": "Показать карту допуска на спецуровень",
            "next": "base_special_level",
            "condition": {"inventory_has_all": ["access_card_special"]}},

            {"text": "Проскочить, пока охрана отвлечена взрывом",
            "next": "base_angar",
            "condition": {"flag_present": "guard_distracted"},
            "gives": {"inventory": {"access_card_special": -1}}},  

            {"text": "Вернуться в коридор",
            "next": "see_base"},
        ],
    },

    "base_special_level": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы подошли к охраняемой двери - массивной структуре из отполированного до зеркального блеска металла. Бдительные малоки, стоявшие на посту, были вооружены тяжелыми бластерами. Вы даже заметили в стенах, потолке и полу круглые углубления, которые служили, скорее всего, для сокрытия турелей."
            "Вы показали малокам ключ. Один из них проверил его в специальном сканирующем устройстве, а второй внимательно следил за вами, должно быть, ждал резкой атаки."
            " - Проходи, - прогрохотал первый малок, и мощная гидравлическая система привела в действие механизмы двери. Когда та ушла в сторону, вам стал виден серо-коричневый стальной коридор с металлической сеткой вместо пола. Тусклые светильники выхватывали из мрака унылый интерьер. Самосветящиеся стрелки направляли прямо к кораблю. Малок протянул вам прожженный ключ доступа."
            "- Теперь он тебе не нужен. Можешь выбросить."
            "Что вы и сделали около ближайшей грависжимающей мусорки."
        ),
        "choices": [{"text": "Идти дальше по указателям", "next": "base_angar",
                    "gives": {"inventory": {"access_card_special": -1}}}
                    ],
    },

    "base_angar": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы вышли и остановились. Большую часть ангара занимала отливающая зеленовато-серым махина с красно-желтым знаменем - тот самый корабль Дзухаллага. Он был окружен различными обслуживающими механизмами. Изнуренный фэянин подключал последние гаджеты к звездолету. Вы обошли махину, на что потребовалось около десяти минут, и заметили то самое уязвимое место в районе топливного бака. Эта была очень тонкая стенка, которую не заметили уставшие ученые. К несчастью, именно возле нее стоял Кацап, ожидая старта. Можно незаметно подкрасться к нему, а можно и заговорить с ним. Только вот что вы будете говорить? Ведь Кацап думает, что вы в своем кабинете. "
 
            "Разве у вас есть план?"
        ),
        "choices": [
            {"text": " Заговорить с ним", "next": "base_angar_speck_katsap"},
            {"text": "Убить его", "next": "base_angar_kill_katsap"}
        ],
    },

    "base_angar_kill_katsap": {
        "title": "Гнездо пиратов",
        "text": (
            "Поскольку босс вас не заметил, вы аккуратно подкрались сзади и подготовились к атаке."
        ),
        "choices": [
            {"text": "Подкрасться сзади и столкнуть его в пропасть", "next": "base_angar_strack_kill"},
            {"text": "Подкрасться и свернуть ему шею", "next": "base_angar_fight_kill"},
        ],
    },

    "base_angar_fight_kill": {
        "title": "Гнездо пиратов",
        "text": (
            " Кацап неожиданно обернулся, раскрыл ваш маневр и ловко увернулся. Заломив вам руки, он одним точным пинком столкнул вас в бездонную корабельную шахту. Вы с ужасом смотрели на приближающуюся тьму..."
        ),
        "choices": [],
    },

    "base_angar_strack_kill": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы тихонько подкрались сзади и, когда Кацап развернулся к вам, столкнули его в бездонную корабельную шахту. Его долгий крик свидетельствовал об успехе вашего дела."
        ),
        "choices": [
            {"text": "К кораблю", "next": "base_angar_go_ship"},
        ],
    },

    "base_angar_speck_katsap": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы спокойно подошли к Кацапу. От удивления пеленг чуть не свалился в пропасть: "
            "- Ты что здесь делаешь, {player_name}?!! "
 
            "Что ему ответить?"
        ),
       "choices": [
            {"text": "Кацап я даю тебе шанс на новую жизнь, вали с базы пока я не передумал",
            "next": "base_angar_let_katsap_go",
            "condition": {"trust_at_least": {"name": "Kacap", "value": 90},
                        "flag_present": "ryaska_given"}},

            {"text": "Да вот, хотел тебе сказать, что... (резко столкнуть его в пропасть) ...за тебя мне дадут солидную награду",
            "next": "base_angar_say_kill_katsap"},
        ],
    },

    "base_angar_let_katsap_go": {
        "title": "Гнездо пиратов",
        "text": (
            "Кацап ошарашенно уставился на вас. Потом медленно, будто пробуя слово на вкус, "
            "произнёс:\n"
            "— Мы друзья… — он хмыкнул. — А я, если честно, думал, что ты меня всё-таки "
            "кинешь. Как все.\n\n"
            "Пеленг почесал затылок, глянул на корабль, на вас, снова на корабль — "
            "и махнул рукой.\n"
            "— Ладно, Череп. Уговорил. Вали сам, раз такой шустрый. Я наверх, "
            "в лифт — и поминай как звали. Только... — он прищурился, — ты это, "
            "не подорви тут всё, пока я наверху. Не хочу в шахте застрять.\n\n"
            "Он коротко хлопнул вас по плечу и зашагал к лифту. Через минуту дверь "
            "за ним закрылась, и вы остались в ангаре один — только гудят двигатели "
            "да тикает таймер на поясе."
        ),
        "choices": [
            {"text": "К кораблю — ставить бомбы", "next": "base_angar_go_ship",
            "gives": {"flags": {"katsap_let_go": True}}},
        ],
    },

    "base_angar_say_kill_katsap": {
        "title": "Гнездо пиратов",
        "text": (
            "  Кацап явно не ожидал такого предательства, и, потеряв равновесие, упал в бездонную корабельную шахту. Его долгий крик свидетельствовал об успехе вашего дела."
        ),
        "choices": [{"text": "К кораблю", "next": "base_angar_go_ship"}],
    },


    "base_laboratory": {
        "title": "Гнездо пиратов",
        "text": (
            " Лаборатории были тесными, маленькими комнатками, заставленными разнообразным оборудованием. Тусклые лампы и экраны компьютеров освещали их в темноте. В дальнем углу стоял ящик с электронными таймерами."
        ),
        "choices": [
            {"text": "Собрать бомбу (нужны: взрывчатка, детонатор)",
            "next": "base_create_bomb",
            "condition": {"inventory_has_all": ["explosive", "detonator"]},
            "gives": {"inventory": {"bomb": 1, "explosive": -1, "detonator": -1},
                    "flags": {"base_create_bomb": True}}},

            {"text": "Осмотреть ящик с таймерами",
            "next": "base_create_bomb_no_parts",
            "condition": {"flag_absent": "base_create_bomb",
            "inventory_not_has_all": ["explosive", "detonator"]}},
            {"text": "Покинуть лабораторию", "next": "see_base"},
        ],
    },

    "base_create_bomb_no_parts": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы повертели в руках таймер, но без взрывчатки и детонатора из него "
            "бомбу не соберёшь. Надо поискать по базе — где-то точно есть."
        ),
        "choices": [{"text": "Назад", "next": "base_laboratory"}],
    },

    "base_create_bomb": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы выложили все найденные компоненты на стол и, достав набор \"Юный радиотехник\", который вы быстро переименовали в \"Юный террорист\", начали собирать бомбу. Через минуту все было готово. У вас есть еще одна бомба."
        ),
        "choices": [
            {"text": "Покинуть лабораторию", "next": "see_base"},
        ],
    },

    "base_other_room": {
        "title": "Гнездо пиратов",
        "text": (
            "  Автоматическая дверь открылась, и вы увидели ученого, работающего с квантоувеличивающим микроскопом. Комната была сделана в традиционном техно-стиле. Резкие, ломаные линии и яркий ровный свет. Самый обычный кабинет для самого обычного секретного комплекса."
            "- Не мешай! - сказал уставший фэянин-ученый. - Не видишь, что я работаю?!"
        ),
        "choices": [
            {"text": "Сказать, что вы пришли помочь ему", "next": "base_help_dok"},
            {"text": "Извиниться и выйти", "next": "see_base"},
        ],
    },

    "base_help_dok": {
        "title": "Гнездо пиратов",
        "text": (
            " В ответ на ваши слова фэянин задумался:"
            "- Правда?.. Ладно, я и так хочу сбежать отсюда, стой! Погоди, - резко спросил он, - а вдруг ты на пеленгов работаешь? Хочешь вскрыть измену коллег? Я тебе не верю! Сейчас охрану позову!"
        ),
        "choices": [
            {"text": "Попытаться успокоить его", "next": "say_dok_ok"},
            {"text": "Дать 100 рублей!", "next": "post_dok_100_rub",
            "condition": {"flag_absent": "post_dok_100_rub", "money_at_least": 100},
            "gives": {"flags": {"post_dok_100_rub": True}, "money": -100}},
            {"text": "Сказать, что вы раскрыли в нем предателя", "next": "you_are_trater"},
        ],
    },

    "say_dok_ok": {
        "title": "Гнездо пиратов",
        "text": (
            "  - Правда... ну... ладно, мне кажется, ты на моей стороне... Знал бы ты, как тяжело здесь работать целыми сутками. Я... я решил сбежать отсюда, но в награду за твою доброту, вот... в кабинете найдешь килограмм взрывчатки и карту доступа к кораблю. Ставь бомбы на топливный бак, вот... Пусть эта махина взлетит на воздух вместе со всем космодромом! Ладно, я пошел... "
            "Фэянин выбежал из кабинета. Вы попытались догнать его, чтобы узнать путь к кораблю, но он, видимо, вбежал в лифт и поднялся на несколько уровней выше. Плюнув на все, вы подошли к двери кабинета фэянина."
        ),
        "choices": [
            {"text": "Далее", "next": "see_dok_lab"},
        ],
    },

    "post_dok_100_rub": {
        "title": "Гнездо пиратов",
        "text": (
            "  - Ну вот! Я же вижу! Ты обманываешь меня!!! Ты - взяточник, как и пеленги!!! - закричал ученый и, резко выхватив у вас из рук сотку, выбежал из кабинета. Вы попытались догнать его, но он, видимо, вбежал в лифт и поднялся на несколько уровней выше. Плюнув на все, вы подошли к двери кабинета фэянина."
        ),
        "choices": [
            {"text": "Далее", "next": "see_dok_lab"},
        ],
    },

    "you_are_trater": {
        "title": "Гнездо пиратов",
        "text": (
            " Фэянин весь затрясся, а затем резко набросился на вас и ударил по голове. Удар был слабым, но фэянин успел выбежать в коридор. Вы попытались догнать его, но он, видимо, вбежал в лифт и поднялся на несколько уровней выше. Плюнув на все, вы подошли к двери кабинета ученого."
        ),
        "choices": [
            {"text": "Далее", "next": "see_dok_lab"},
        ],
    },

    "see_dok_lab": {
        "title": "Гнездо пиратов",
        "text": (
            "Автоматическая дверь открылась, и вы вошли в пустой кабинет с плоским компьютером "
            "и квантоувеличивающим микроскопом. Комната была сделана в традиционном техно-стиле. "
            "Резкие, ломаные линии и яркий ровный свет. Самый обычный кабинет для самого обычного "
            "секретного комплекса."
        ),
        "choices": [
            {"text": "Обыскать кабинет", "next": "search_dok_lab",
            "condition": {"flag_absent": "searched_dok_lab"},
            "gives": {"flags": {"searched_dok_lab": True},
            "inventory": {"explosive": 1, "access_card_special": 1}}},
            {"text": "Оставить бомбу с 15 минутами", "next": "set_bomb_15_min",
            "condition": {"inventory_has_all": ["bomb"], "flag_absent": "bomb_15_min_used"},
            "gives": {"inventory": {"bomb": -1}, "flags": {"bomb_15_min_used": True}}},
            {"text": "Покинуть кабинет", "next": "see_base"},
        ],
    },

    "search_dok_lab": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы подошли к столу и обыскали вещи, лежавшие на нем. Изучив завернутый в серую бумагу сверток, вы обнаружили в нем килограмм взрывчатки. Пригодится для создания бомбы. Также вы присвоили себе блестящую карту допуска на специальный уровень, которую кто-то глупо забыл на столе."
        ),
        "choices": [
            {"text": "Покинуть кабинет", "next": "see_base"},
        ],
    },

    "set_bomb_15_min": {
        "title": "Гнездо пиратов",
        "text": (
            " Не жалко пожертвовать одну, чтобы убрать охранников с двери ведущей в ангар."
        ),
        "choices": [
            {"text": "Выбежать из кабинета", "next": "see_base",
            "gives": {"flags": {"guard_distracted": True}}},
        ],
    },

    "base_my_room": {
        "title": "Гнездо пиратов",
        "text": (
            "Комната была сделана в традиционном техно-стиле. Резкие, ломаные линии, яркий ровный свет, плоский компьютер и квантоувеличивающий микроскоп."
        ),
        "choices": [
            {"text": "Обыскать кабинет", "next": "base_search_my_room",
            "condition": {"flag_absent": "base_search_my_room"},
            "gives": {"flags": {"base_search_my_room": True},
            "inventory": {"detonator": 1}}},
            {"text": "Работать с компьютером", "next": "base_computer_work"},
            {"text": "Посмотреть в микроскоп", "next": "base_see_microscop"},
            {"text": "Выйти из кабинета", "next": "see_base"},
        ],
    },

    "base_see_microscop": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы посмотрели в микроскоп. Гаальская (или фэянская?) технология увеличивала любые предметы до квантов. Только квантов самих было не видно. Вы переключились на молекулярный уровень и стали наблюдать. "
            "Вот одна молекула сцепилась с другой. Обе молекулы объединились в одну. Поразительное зрелище не заканчивалось. Дальше следовал эффектный распад молекулы на атомы и... "
            "Вы оторвались от интересного зрелища. Все-таки вам нужно еще корабль взорвать."
        ),
        "choices": [
            {"text": "Переключить увеличение на биологический уровень", "next": "base_see_bio_lvl"},
            {"text": "Отойти от микроскопа", "next": "base_my_room"},
            {"text": "Выйти из кабинета", "next": "see_base"},
        ],
    },

    "base_see_bio_lvl": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы открутили увеличение до биологического уровня и поняли, кому принадлежали молекулы. В микроскоп виднелась прозрачная амеба с семью ложноножками. Амеба словно почувствовала, что на нее смотрят, и угрожающе замахала конечностями."
        ),
        "choices": [
            {"text": "Ткнуть амебу чем-нибудь в бок", "next": "strick_ameba"},
            {"text": "Отойти от микроскопа", "next": "base_my_room"},
            {"text": "Отпрыгнуть от микроскопа, пока эта ужасная амеба не заразила вас своими микробами", "next": "see_base"},
        ],
    },

    "strick_ameba": {
        "title": "Гнездо пиратов",
        "text": (
            " Вам повезло: вы нашли тонкий волос на столе, цвет которого показался вам смутно знакомым. Ну, не важно. Вы приложили глаз к микроскопу и аккуратно просунули волос подальше от амебы... затем ближе... еще ближе... пока в конце концов не прихлопнули амебу длинной пористой трубой (именно так ваш выпавший волос выглядел в микроскоп). "
            " Амеба такого отношения не оценила и далеко откинула волос ложноножками в пределах видимости. Затем, аккуратно подплыв ближе к камере, распахнула усеянную острыми зубами пасть и заплевала квантовую увеличивающую сеть какой-то серой дрянью, которая мерзко ползала по всему полю видимости. Вы испугались: как бы не подхватить каких-нибудь амебных бактерий..."
        ),
        "choices": [
            {"text": "Отпрыгнуть от микроскопа", "next": "see_base"},
        ],
    },

    "base_search_my_room": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы подошли к компьютеру с запущенной операционной системой. Может, тут есть что-нибудь интересное. Просмотрев пару файлов, вы разочаровались: это были устаревшие данные, еще со времен начала строительства корабля. Полистав файлы, вы решили глянуть программы. Но в них тоже не было ничего интересного. Только какая-то программа с серым полем с разбросанными на нем кружочками и стрелочками. Так или иначе, делать здесь больше нечего."
        ),
        "choices": [
            {"text": "Обдумать дальнейшие действия", "next": "base_my_room"},
        ],
    },

    "base_computer_work": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы подошли к компьютеру с запущенной операционной системой. Может, тут есть что-нибудь интересное. Просмотрев пару файлов, вы разочаровались: это были устаревшие данные, еще со времен начала строительства корабля. Полистав файлы, вы решили глянуть программы. Но в них тоже не было ничего интересного. Только какая-то программа с серым полем с разбросанными на нем кружочками и стрелочками. Так или иначе, делать здесь больше нечего."
        ),
        "choices": [
            {"text": "Обдумать дальнейшие действия", "next": "base_my_room"},
        ],
    },

    "base_angar_go_ship": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы подбежали к корабельному баку. Топливный бак был сочного зеленого цвета, с метровой толщины стенками. Только в одном месте стенка была тонкая, толщиной примерно в полметра, и вы решили прикрепить бомбу именно туда."
            "- Внимание! - послышалось со всех сторон. - Всем пеленгам и другим гуманоидам покинуть место запуска! "
            "Загудели сирены. "
            "- 100... 99... 98..."
            "Шлюзы выхода уже начали открываться. Над ними часто мигала предупреждающая красная лампочка. Нужно скорее установить бомбу и бежать отсюда."
        ),
        "choices": [
            {"text": "Заминировать топливный бак", "next": "base_set_boombs"},
            {"text": "У меня нет бомб! Придётся вернуться", "next": "see_base",
            "condition": {"inventory_absent": "bomb"}},
        ],
    },

    "base_set_boombs": {
        "title": "Гнездо пиратов",
        "text": (
            " - 97... - продолжался отсчет, - 96... 95... 94..."
            "Зашумели двигатели. Вы мимолетно глянули вниз и увидели огненные отблески в бездонной черноте пропасти. "
            "Насколько вы помнили, нужно установить не менее двух бомб для взрыва. Одна бомба вряд ли взорвет корабль... "
 
            "Сколько бомб подложим под топливный бак?"
        ),
        "choices": [
            {"text": "У меня нет бомб", "next": "see_base",
            "condition": {"inventory_absent": "bomb"}},
           {"text": "1 бомбу", "next": "set_bombs_common",
            "condition": {"inventory_at_least": {"bomb": 1}},
            "gives": {"inventory": {"bomb": -1}, "flags": {"bombs_placed": 1}}},

            {"text": "2 бомбы", "next": "set_bombs_common",
            "condition": {"inventory_at_least": {"bomb": 2}},
            "gives": {"inventory": {"bomb": -2}, "flags": {"bombs_placed": 2}}},

            {"text": "3 бомбы", "next": "set_bombs_common",
            "condition": {"inventory_at_least": {"bomb": 3}},
            "gives": {"inventory": {"bomb": -3}, "flags": {"bombs_placed": 3}}},

            {"text": "4 бомбы", "next": "set_bombs_common",
            "condition": {"inventory_at_least": {"bomb": 4}},
            "gives": {"inventory": {"bomb": -4}, "flags": {"bombs_placed": 4}}},
        ],
    },  

    "set_bombs_common": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы подложили бомбы и быстро направились к выходу. Шлюзы почти закрылись, но вы успели выбежать. Промчавшись к лифту, вы щелкнули наземный уровень и устало сели на пол. Лифт остановился."
        ),
        "choices": [
            {"text": "Выйти из лифта и ждать флаер", "next": "mission_escape"},
        ],
    }, 

    "mission_escape": {
        "title": "Гнездо пиратов",
        "text": (
            "Вы выбрались с космодрома и залегли в укрытии. Секунды тянулись "
            "невыносимо. Наконец земля вздрогнула, и над горизонтом вспух "
            "ослепительный гриб."
        ),
       "choices": [
           {"text": "Вызвать личный корабль и бежать к нему", "next": "mission_end_secret",
            "condition": {
                "flag_present": "cosmo_intel_ok",
                "flag_absent": "cosmo_intel_bad",
                "flags_exact": {
                    "bombs_placed": 4,
                    "ryaska_ok": True,
                    "ryaska_given": True,
                    "katsap_let_go": True,
                },
                "trust_at_least": {"name": "Kacap", "value": 90},
            }},

            {"text": "Наблюдать за взрывом", "next": "mission_end_ok",
            "condition": {"flag_present": "cosmo_intel_ok",
                        "flag_absent": "cosmo_intel_bad"}},

            {"text": "Наблюдать за взрывом", "next": "mission_end_fail"},
        ],
    },

    "mission_end_secret": {
        "title": "Гнездо пиратов",
           "text": (
            " Четыре зарядов сделали то, чего не смогли бы два. Первый пробил топливный бак, "
            "второй рванул силовую установку, третий — реактор, а четвёртый и пятый "
            "сложили крейсер пополам, как дешёвую игрушку. Ударная волна прошлась "
            "по космодрому, снесла ангары и вмяла в землю наблюдательные вышки.\n\n"
            "А потом земля треснула.\n\n"
            "Вы успели добежать до корабля и подняться на орбиту — чип в голове "
            "сработал быстрее, чем вы успели осознать, что происходит. И вот с высоты "
            "двухсот километров вы смотрели, как луна разваливается на части.\n\n"
            "Трещина шла от воронки на месте космодрома — сначала тонкая, как нитка, "
            "потом всё шире, всё глубже. Из неё вырывались облака раскалённой пыли, "
            "лава затапливала долины, оранжевые равнины чернели и корёжились. "
            "Через час от второй луны Полуоси осталась только половина — остальное "
            "медленно разлеталось по орбите кусками породы размером с город.\n\n"
            "Чип пискнул. Русман молчал долго. Потом сказал — тихо, без обычной "
            "своей иронии:\n"
            "— {player_name}. Ты... ты понимаешь, что ты натворил?\n\n"
            "— Я выполнил задание, — ответили вы.\n\n"
            "— Ты уничтожил луну. Целиком. Со всем населением, со всей "
            "инфраструктурой, с... — он сбился, — с половиной экосистемы Полуоси. "
            "У них там приливные циклы сбились. У них там...\n\n"
            "Русман замолчал.\n\n"
            "— Кредитов не будет. За такое не платят, за такое объявляют "
            "в межгалактический розыск. Галактический Совет уже собирается на "
            "экстренное заседание. Дзухаллаг открестится от тебя быстрее, чем ты "
            "успеешь сказать «это была случайность». Тебе надо убираться из системы. "
            "Прямо сейчас. И... не возвращайся.\n\n"
            "Чип отключился.\n\n"
            "Вы сидели в кресле пилота и смотрели в иллюминатор. Там, внизу, "
            "догорала вторая луна — и медленно расползалась на куски, как гнилой "
            "фрукт. На её месте уже поднималось облако обломков, которое через "
            "несколько часов начнёт падать на саму Полуось.\n\n"
            "Вы завели синхродвигатели и ушли в гиперпрыжок.\n\n"
            "Через сутки во всех новостных каналах Галактики — от гаальских "
            "официальных сводок до пиратских сплетен в барах на Рахише — "
            "крутили одну и ту же запись: любительский снимок с орбитального "
            "зонда, на котором луна разваливается на куски. И подпись:\n\n"
            "«{player_name} — Сокрушитель Планет».\n\n"
            "Денег вы не получили. Зато получили имя, которое теперь будут "
            "произносить шёпотом — и в Галактическом Совете, и в пиратских "
            "логововах, и в самых дальних уголках обитаемого космоса.\n\n"
            "Вот только рады ли вы этому — вы пока не решили."
        ),
        "choices": [],
    }, 

    "mission_end_ok": {
        "title": "Гнездо пиратов",
         "text": (
            " Корабль взорвался и с адским грохотом рухнул на космодром, погребя под собой "
            "тысячи пеленгов и их подручных. Взрывная волна прошлась по долине, снесла "
            "наблюдательные вышки и подняла в воздух столб оранжевой пыли.\n\n"
            "Вы выбрались из укрытия и принялись ждать спасательный флаер. Час. Два. Три... "
            "Никто не прилетал. Вы стучали зубами от холода, проклинали Русмана, "
            "всех агентов Окошек Висты и собственную доверчивость.\n\n"
            "На четвёртом часу чип в голове тихо пискнул, и в сознании прорезался "
            "знакомый небритый голос:\n"
            "— {player_name}, ты живой? Отлично. Слушай, у меня тут навигация "
            "сбоит, я к тебе подойти не могу — зато твой корабль уже в пути. "
            "Кредиты перевёл. И это... спасибо. Реально спасибо.\n\n"
            "Чип замолчал. С неба медленно опускался ваш корабль — синхродвигатели "
            "гудели, как сытый кот.\n\n"
            "Вы забрались в кабину, согрелись, завели двигатели и покинули эту луну. "
            "Где-то внизу догорал космодром. Задание выполнено."
        ),
        "choices": [],
    }, 

    "mission_end_fail": {
        "title": "Гнездо пиратов",
        "text": (
            "Корабль взорвался и с адским грохотом рухнул на космодром. Взрывная волна "
            "прошлась по долине, снесла наблюдательные вышки и подняла в воздух столб "
            "оранжевой пыли.\n\n"
            "Вы выбрались из укрытия и принялись ждать спасательный флаер. Час. Два. Три... "
            "Никто не прилетал. Вы стучали зубами от холода и проклинали всё на свете.\n\n"
            "На четвёртом часу чип в голове тихо пискнул, и в сознании прорезался "
            "знакомый небритый голос:\n"
            "— {player_name}... ты же сказал первый материк. А я тут, на втором, "
            "уже полдня прочёсываю ледяные пустоши. Связь еле держится, навигация врёт, "
            "топлива на обратный путь в обрез. Я тебя не найду. Прости.\n\n"
            "Чип пискнул и погас.\n\n"
            "Вы остались одни на выжженной руине посреди безжизненного материка. "
            "Рация молчала. Корабль — где-то за тысячи километров, и сигнал до него "
            "не доставал. Ветер гнал по бетону обгоревшие обломки, и с каждой минутой "
            "становилось всё холоднее.\n\n"
            "К утру вы уже не чувствовали ни пальцев, ни лица. Задание было выполнено — "
            "крейсер уничтожен, космодром стёрт с лица луны. Вот только "
            "найти вас так и не смогли. Кредиты, обещанные заказчиком, остались "
            "на счетах Окошек Висты — вместе с вашей славой безжалостного "
            "космического пирата."
        ),
        "choices": [],
    }, 

    "mission_end_timeout": {
        "title": "Гнездо пиратов",
        "text": (
            " Вы просыпаетесь от того, что пол под ногами вздрагивает. "
            "За окном — ослепительная вспышка, потом ещё одна. "
            "Сирена, крики, топот ног по коридору.\n\n"
            "Вы выбегаете из комнаты. В коридоре — паника. Учёные бегут "
            "к лифту, малоки-охранники куда-то исчезли. А в окнах — "
            "медленно поднимающийся в небо крейсер. Он уже стартовал.\n\n"
            "Слишком поздно. Пока вы спали, пока разбирались с Кацапом, "
            "пока искали подходы — три дня прошли. Крейсер Дзухаллага ушёл "
            "в космос, и теперь его не достать. Галактика станет ещё на одну "
            "войну беднее, а вы — ещё на один провал.\n\n"
            "Можно, конечно, вернуться в космопорт, связаться с Русманом, "
            "что-то объяснить. Но вы уже знаете, что он скажет. И что скажет "
            "заказчик.\n\n"
            "Задание провалено. В следующий раз спите меньше."
        ),
        "choices": [],
    },
}


def get_scene(name: str) -> dict:
    if name not in SCENES:
        raise KeyError(f"Сцена '{name}' не найдена")
    return SCENES[name]

def visible_choices(scene: dict, state: dict) -> list[dict]:
    visible = []
    for choice in scene["choices"]:
        condition = choice.get("condition")
        if condition is None:
            visible.append(choice)
            continue

        ok = True
        for key, value in condition.items():
            if key == "flag_absent":
                if state["flags"].get(value):
                    ok = False
            elif key == "flag_present":
                if not state["flags"].get(value):
                    ok = False
            elif key == "flags_all":
                for name in value:
                    if not state["flags"].get(name):
                        ok = False
                        break
            elif key == "flags_exact":
                for name, expected in value.items():
                    if state["flags"].get(name) != expected:
                        ok = False
                        break
            elif key == "flags_not_exact":
                all_match = True
                for name, expected in value.items():
                    if state["flags"].get(name) != expected:
                        all_match = False
                        break
                if all_match:
                    ok = False
            elif key == "inventory_absent":
                if state["inventory"].get(value):
                    ok = False
            elif key == "inventory_has_all":
                for item in value:
                    if not state["inventory"].get(item):
                        ok = False
                        break
            elif key == "inventory_at_least":                    
                for item, minimum in value.items():
                    if state["inventory"].get(item, 0) < minimum:
                        ok = False
                        break
            elif key == "inventory_not_has_all":
                if all(state["inventory"].get(item) for item in value):
                    ok = False
            elif key == "money_at_least":
                if state["money"] < value:
                    ok = False
            elif key == "days_at_least":
                if state["days"] < value:
                    ok = False
            elif key == "days_below":
                if state["days"] >= value:
                    ok = False
            elif key == "trust_below":
                if state["trust"].get(value["name"], 0) >= value["value"]:
                    ok = False
            elif key == "trust_at_least":
                if state["trust"].get(value["name"], 0) < value["value"]:
                    ok = False
            else:
                raise ValueError(
                    f"Неизвестное условие выбора: {key!r} = {value!r}"
                )

        if ok:
            visible.append(choice)

    return visible

def apply_effects(state: dict, gives: Optional[dict]) -> None:
    if not gives:
        return
    
    if "flags" in gives:
        for name, value in gives["flags"].items():
            state["flags"][name] = value

    if "money" in gives:
        state["money"] += gives["money"]

    if "inventory" in gives:
        for item, qty in gives["inventory"].items():
            state["inventory"][item] = state["inventory"].get(item, 0) + qty
            if state["inventory"][item] <= 0:
                del state["inventory"][item]

    if "trust" in gives:
        for name, delta in gives["trust"].items():
            current = state["trust"].get(name, 0)
            state["trust"][name] = max(0, min(100, current + delta))

    if "days" in gives:
        state["days"] = max(0, state["days"] + gives["days"])

def make_choice(current: str, choice_index: int, state: dict) -> tuple[str, dict]:
    scene = get_scene(current)
    visible = visible_choices(scene, state)
    if not visible:
        raise ValueError(f"Сцена '{current}' — нет доступных выборов")
    if choice_index < 0 or choice_index >= len(visible):
        raise IndexError(f"Неверный индекс выбора: {choice_index}")
    choice = visible[choice_index]
    return choice["next"], choice